XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Renesas.RA_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.7.2" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
	<vendor>Renesas</vendor>
	<name>RA_DFP</name>
	<description>Renesas RA series device family pack</description>
	<repository></repository>
	<supportContact></supportContact>
	<license></license>

  <!-- URL where this pack is hosted -->
<url>https://www2.renesas.eu/Keil_MDK_Packs/</url>
 
	<releases>
		<release version="5.2.0" date="2024-02-19">
		FSP 5.2.0 synchronised release. Adds support for RA2A2 and RA0E1.
		</release>
		<release version="5.1.0" date="2023-12-01">
		FSP 5.1.0 synchronised release. Adds support for RA8D1 and RA8T1.
		Updated SVD files for RA2E1, RA2E2, RA2E3, RA2L1 and RA8M1.
		</release>
		<release version="5.0.1" date="2023-11-08">
		FSP 5.0.1 synchronised release. No functional change.
		</release>
		<release version="5.0.0" date="2023-10-17">
		FSP 5.0.0 synchronised release. Adds support for RA8M1 and RA2E3.
		Updated SVD file for RA2L1.
		</release>
		<release version="4.6.0" date="2023-08-16">
		FSP 4.6.0 synchronised release.
		Updated SVD files for RA4M2, RA4M3, RA4E2, RA6M3, RA6M4, RA6M5 and RA6E2.
		</release>
		<release version="4.5.0" date="2023-06-19">
		FSP 4.5.0 synchronised release.
		Updated SVD files for RA4M2, RA4T1 and RA6T3.
		Added ULINK trace setup for RA4M2, RA4M3, RA6M4, RA6M5 and RA6T2.
		</release>
		<release version="4.4.0" date="2023-04-14">
		FSP 4.4.0 synchronised release. Adds support for RA4T1 and RA6T3.
		Updated SVD files for RA4E2 and RA6E2.
		Updated rasc_launcher.bat to fix refresh issue that could cause build failures in certain circumstances. 
		Removed unnecessary options from generator id="Renesas RA Smart Configurator".
		</release>
		<release version="4.3.0" date="2023-02-13">
		FSP 4.3.0 synchronised release. Adds support for RA4E2 and RA6E2
		</release>
		<release version="4.2.0" date="2022-12-12">
		FSP 4.2.0 synchronised release.
		Updated SVD files for RA2E1, RA2E2, RA2L1, RA4E1, RA4M2 and RA6E1.
		</release>
		<release version="4.1.0" date="2022-10-20">
		FSP 4.1.0 synchronised release.
		Updated rasc_launcher.bat to fix issue identifying RASC 2022-10 executable.
		Updated SVD files for RA2A1, RA2E2, RA2L1, RA4M3, RA4W1, RA6M4, RA6M5 and RA6T2.
		Removed device variants containing package info in name as RASC will always specify non-package short form in generated projects.
		Removed boards and examples elements, as incomplete and not required for usage in conjunction with FSP and RASC.
		</release>
		<release version="4.0.0" date="2022-08-08">
		FSP 4.0.0 synchronised release.
		Updated SVD files for RA2E2, RA4W1 and RA6T2.
		</release>
		<release version="3.8.0" date="2022-06-16">
		FSP 3.8.0 synchronised release.
		Updated SVD files for RA2L1 and RA6T1.
		</release>
		<release version="3.7.0" date="2022-04-22">
		FSP 3.7.0 synchronised release.
		Updated SVD files for RA2E2, RA4M2, RA4M3, RA6E1, RA6M4 and RA6T2.
		Updated flash programming support for RA2A1, RA2E1, RA2E2, RA2L1, RA4M1, RA4M3, RA4W1, RA6M4 and RA6M5.
		</release>
		<release version="3.6.0" date="2022-02-23">
		FSP 3.6.0 synchronised release.
		Updated rasc_launcher.bat.
		Various cleanups to PDSC file to reduce duplication of settings.
		All device families now reference family specific SVD files.
		Updated flash programming support for RA2L1, RA2E1 and RA2E2.
		</release>
		<release version="3.5.0" date="2021-12-09">
		FSP 3.5.0 synchronised release. Adds support for RA6T2
		Add ULINK Flash Programing for RA2E2, RA6T1, RA6T2, RA6E1, RA4E1
		Note ULINK support is only available for TrustZone enabled devices in Flat mode.
		</release>
		<release version="3.4.0" date="2021-10-12">
		FSP 3.4.0 synchronised release. Adds support for RA2E2. 
		Includes integrated ULINK compatible Flash algorithms
		for the following parts:-
		RA2A1, RA2E1, RA2L1, RA4M1, RA4M2, RA4M3, RA4W1, RA6M1, RA6M2, RA6M3, RA6M4, RA6M5.
		Note UKINK support is only available for TrustZone enabled devices in Flat mode.
		</release>
		<release version="3.3.0" date="2021-09-21">
		FSP 3.3.0 synchronised release. Adds support for RA4E1 and RA6E1
		</release>			
		<release version="3.2.0-alpha.0" date="2021-07-13">
		FSP 3.2.0 synchronised release
		</release>	
		<release version="3.1.0" date="2021-06-28">
		FSP 3.1.0 synchronised release
		</release>	
		<release version="3.0.1" date="2021-06-04">
		FSP 3.0.1 synchronised release
		Adds support for RA2L1A9 devices
		</release>
		<release version="3.0.0" date="2021-04-28">
		FSP 3.0.0 synchronised release
		</release>
		<release version="2.4.0" date="2021-03-30">
		FSP 2.4.0 synchronised release
		Adds support for RA6M5
		</release>	
		<release version="2.3.0" date="2021-01-26">
		FSP 2.3.0 synchronised release
		Adds support for RL2E1 and RA4M2
		</release>		
		<release version="2.2.0" date="2020-12-01">
		FSP 2.2.0 synchronised release
		Adds support for RL2L1 and RA4M3
		</release>	
		<release version="2.1.0" date="2020-10-29">
		FSP 2.1.0 synchronised release
		Adds support for RA6T1
		</release>	
		<release version="2.0.0" date="2020-10-01">
		FSP 2.0.0 synchronised release. 	
		Supports all RA M23 and M4 devices with FSP 2.0 
		RA6M4 with Flat model only. No TrustZone support.
		IMPORTANT. 
		This pack can only be used with FSP 2.0 or later 
		as the linker script folder structure has changed. 	
		</release>
		<release version="1.3.0" date="2020-08-21">
		FSP 1.3.0 synchronised release, no functional change
		</release>
		<release version="1.2.0" date="2020-06-30">
		FSP 1.2.0 synchronised release, no functional change
		</release>		
		<release version="1.1.1" date="2020-05-29">
		FSP 1.1.1 synchronised release, no functional change
		</release>
		<release version="1.1.0" date="2020-05-06">
		FSP 1.1.0 synchronised release, adds support for RA4W1
		</release>
		<release version="1.0.0" date="2020-03-31">
		FSP 1.0.0 synchronised release
		</release>
	</releases>

	<keywords>
		<!-- keywords for indexing -->
		<keyword>Renesas</keyword>
		<keyword>RA</keyword>
		<keyword>4M</keyword>
		<keyword>6M</keyword>
		<keyword>2M</keyword>
	</keywords>

	<requirements>
		<languages>
		  <language name="C" version="99"/>
		</languages>
		<compilers>
		  <!-- FSP tested with at least AC6 version 6.18.0  -->
		  <compiler name="ARMCC" version="6.18.0"/>
		</compilers>
	  </requirements>
  
	<!-- NOTE: Each RA device family pack needs this -->
	<generators>
    <generator id="Renesas RA Smart Configurator">
      <description>Renesas RA Smart Configurator</description>
      <exe>
        <command host="win">launcher\rasc_launcher.bat</command>
        <argument>"$Prasc_version.txt"</argument>
        <argument>"$Pconfiguration.xml"</argument>
      </exe>
      <gpdsc name="buildinfo.gpdsc"/>
    </generator>
  </generators>

  	<!-- Part number definitions -->
   <devices>

		<!-- RA2A1 Part number definitions -->
		<family Dfamily="RA2A1 Series" Dvendor="Renesas:117">

