XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Renesas.RA_DFP.pdsc
			<processor Dcore="Cortex-M23" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="MPU" Ddsp="NO_DSP" Dendian="Little-endian" Dclock="48000000" />
			<description>
The RA2A1 Group of microcontrollers (MCUs) uses a high-performance Arm® Cortex®-M23 core and offers highly integrated, high-accuracy analog capabilities. 
This group of ICs offers a complete MCU with analog solution for signal conditioning and measurement. 
The RA2A1 Group supports a wide operating voltage range of 1.6V to 5.5V. It includes a 16-bit SAR ADC, 24-bit Sigma-Delta ADC, comparators, operational amplifiers, and DACs.
 
The RA2A1 MCU targets cost sensitive and low power industrial sensor applications where high resolution analog will become a cost benefit.
			
Applications

- Industrial automation (photoelectric sensor, fiber sensor, temperature sensor)
- Building automation/home appliance (smoke detector)
- Healthcare (pulse oximeters, body composition measurement)
- General purpose

			</description> 
			<feature type="Timer" 				n="1"	m="32"			name="General PWM Timer (GPT)"/>			
			<feature type="Timer" 				n="6"	m="16"			name="General PWM Timer (GPT)"/>
			<feature type="Timer"      			n="2"	m="16"			name="Asynchronous General Purpose Timer (AGT)"/>
			<feature type="RTC"     						   			name="Real Time CLock"/>
			<feature type="WDT"					n="1"	m="14"			name="Watchdog Timer (WDT)"/>
			<feature type="WDT"					n="1"	m="14"			name="Independent Watchdog Timer (IWDT)"/>	
			<feature type="ComOther"			n="3"					name="Serial Communications Interface (SCI)"/>	
			<feature type="I2C"					n="2"					name="I2C bus interface (IIC)"/>	
			<feature type="SPI"					n="2"					name="Serial Peripheral Interface (SPI)"/>	
			<feature type="CAN"					n="1"					name="Controller Area Network (CAN)"/>				
			<feature type="ADC"					n="17"	m="16"			name="16-bit A/D Converter (ADC16)"/>	
			<feature type="ADC"					n="10"	m="24"			name="24-bit Sigma-Delta A/D Converter (SDADC24)"/>
			<feature type="DAC"					n="1"	m="12"			name="12-bit D/A Converter (DAC12)"/>			
			<feature type="DAC"					n="1"	m="8"			name="8-bit D/A Converter (DAC8)"/>
			<feature type="TempSens"			n="1"					name="Temperature Sensor (TSN)"/>	
			<feature type="CoreOther"			n="1"					name="High-Speed Analog Comparator(ACMPHS)"/>			
			<feature type="CoreOther"			n="1"					name="Low-Power Analog Comparator(ACMPLP)"/>
			<feature type="Other"				n="3"					name="Operational Amplifier (OPAMP)"/>
			<feature type="Touch"				n="26"					name="Capacitive Touch Sensing Unit(CTSU)"/>
			<feature type="CoreOther"			n="1"					name="Cyclic Redundancy Check (CRC) calculator"/>			
			<feature type="CoreOther"			n="1"					name="Data Operation Circuit (DOC)"/>
			<feature type="Crypto"				n="128.256"				name="AES Engine"/>	
			<feature type="RNG"											name="True Random Number Generator(TRNG)"/>			
			<feature type="Memory"				n="256"					name="Code Flash Kbytes"/>
			<feature type="Memory"				n="32"					name="SRAM Kbytes"/>
			<feature type="Memory"				n="8"					name="Data Flash Kbytes"/>			
			<feature type="PLL"         		n="1"                   name="Internal PLL"/>
			<feature type="VCC"         		n="1.6"   m="5.5"       name="Power Supply Voltage"/>
			<feature type="Temp"        		n="-40"   m="105"       name="Operating Temperature Range"/>
			<feature type="QFP"        			n="32"                  name="Leadless Quad Flat Pack (LQFP)"/>
			<feature type="QFP"        			n="64"                  name="Leadless Quad Flat Pack (LQFP"/>
			<feature type="BGA"        			n="36"                  name="Ball Grid Array"/>
			<feature type="QFN"        			n="48.40"               name="Quad-Flat No-leads"/>
			<feature type="XTAL"        		m="48000000"            name="Maximum operating frequency"/>
			<feature type="PLL"        		            				name="4 internal PLLs"/>
			<debug	svd="SVD/R7FA2A1AB.svd"/>
			<subFamily DsubFamily="RA2A1_256K">
				<memory name="Flash"     access="rx" start="0"          size="0x040000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x40100000" size="0x002000"/>
				<memory name="ConfigROM" access="r"  start="0x01010000" size="0x34"/>
				<memory name="SRAM1"    access="rwx" start="0x20000000" size="0x008000" init   ="0" default="1"/>
				<algorithm name="Flash/RA2A1_256K.FLM"          start="0x00000000" size="0x040000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA2A1_DATA.FLM"    		start="0x40100000" size="0x002000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA2A1_CONF.FLM"          start="0x01010000" size="0x000034" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>	
				<device Dname="R7FA2A1AB"/>
			</subFamily>			
		</family>

		<!-- RA2L1 Part number definitions -->

 		<family Dfamily="RA2L1 Series" Dvendor="Renesas:117">
			<processor Dcore="Cortex-M23" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="MPU" Ddsp="NO_DSP" Dendian="Little-endian" Dclock="120000000" />
			<description>
The Renesas RA2L1 microcontroller.

			</description>
			<feature type="Timer" 				n="4"	m="32"			name="General PWM Timer (GPT32EH)"/>			
			<feature type="Timer" 				n="4"	m="32"			name="General PWM Timer (GPT32E)"/>
			<feature type="Timer" 				n="5"	m="32"			name="General PWM Timer (GPT32)"/>
			<feature type="Timer"      			n="2"	m="16"			name="Asynchronous General Purpose Timer (AGT)"/>
			<feature type="RTC"     						   			name="Real Time CLock"/>
			<feature type="WDT"					n="1"	m="14"			name="Watchdog Timer (WDT)"/>
			<feature type="WDT"					n="1"	m="14"			name="Independent Watchdog Timer (IWDT)"/>	
			<feature type="ComOther"			n="7"					name="Serial Communications Interface (SCI)"/>	
			<feature type="ComOther"			n="1"					name="Serial Communications Interface (IrDA)"/>	
			<feature type="I2C"					n="2"					name="I2C bus interface (IIC)"/>	
			<feature type="SPI"					n="2"					name="Serial Peripheral Interface (SPI)"/>	
			<feature type="CAN"					n="2"					name="Controller Area Network (CAN)"/>				
			<feature type="ADC"					n="19"	m="12"			name="12-bit A/D Converter (ADC12)"/>	
			<feature type="DAC"					n="1"	m="12"			name="12-bit D/A Converter (DAC12)"/>			
			<feature type="TempSens"			n="1"					name="Temperature Sensor (TSN)"/>	
			<feature type="CoreOther"			n="6"					name="High-Speed Analog Comparator(ACMPHS)"/>			
			<feature type="Touch"				n="12"					name="Capacitive Touch Sensing Unit(CTSU)"/>
			<feature type="CoreOther"			n="1"					name="Cyclic Redundancy Check (CRC) calculator"/>			
			<feature type="CoreOther"			n="1"					name="Data Operation Circuit (DOC)"/>
			<feature type="Crypto"				n="128"					name="AES128 Engine"/>	
			<feature type="Crypto"				n="192"					name="AES192 Engine"/>	
			<feature type="Crypto"				n="256"					name="AES256 Engine"/>	
			<feature type="Crypto"				n="192"					name="3DES Engine"/>
			<feature type="Crypto"				n="2018"				name="ARC4 Engine"/>			
			<feature type="RNG"											name="True Random Number Generator(TRNG)"/>			
			<feature type="Memory"				n="256"					name="Code Flash Kbytes"/>
			<feature type="Memory"				n="32"					name="SRAM Kbytes"/>
			<feature type="Memory"				n="8"					name="Data Flash Kbytes"/>			
			<feature type="PLL"         		n="1"                   name="Internal PLL"/>
			<feature type="VCC"         		n="1.6"   m="5.5"       name="Power Supply Voltage"/>
			<feature type="Temp"        		n="-40"   m="105"       name="Operating Temperature Range"/>
			<feature type="QFP"        			n="100.64"           	name="Leadless Quad Flat Pack (LQFP)"/>
			<feature type="QFN"        			n="64"            		name="Quad-Flat No-leads"/>
			<feature type="XTAL"        		m="120000000"           name="Maximum operating frequency"/>
			<feature type="PLL"        		            				name="5 internal PLLs"/>
			<feature type="DMA"        		    n="8"        			name="DMAC"/>
			<feature type="USBD"       		    n="1"        			name="USB Device "/>
			<feature type="USBH"       		    n="1"        			name="USB Host"/>					
			<debug	svd="SVD/R7FA2L1AB.svd"/>

			<subFamily DsubFamily="RA2L1_256K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x040000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x40100000" size="0x002000"/>
				<memory name="ConfigROM" access="r"  start="0x01010000" size="0x34"/>
				<memory name="SRAM1"    access="rwx" start="0x20000000" size="0x008000" init   ="0" default="1"/>
				<algorithm name="Flash/RA2L1_256K.FLM"          start="0x00000000" size="0x040000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA2L1_DATA.FLM"          start="0x40100000" size="0x002000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA2L1_CONF.FLM"          start="0x01010000" size="0x000034" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA2L1AB" />
			</subFamily>

