XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Renesas.RA_DFP.pdsc
			<subFamily DsubFamily="RA2E1_32K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x020000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x40100000" size="0x001000"/>
				<memory name="ConfigROM" access="r"  start="0x01010000" size="0x34"/>
				<memory name="SRAM1"    access="rwx" start="0x20004000" size="0x004000" init   ="0" default="1"/>
				<algorithm name="Flash/RA2E1_32K.FLM"           start="0x00000000" size="0x008000" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA2E1_DATA.FLM"          start="0x40100000" size="0x001000" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA2E1_CONF.FLM"          start="0x01010000" size="0x000034" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA2E1A5"/>	
			</subFamily>
		</family>

	<!-- RA2E2 Part number definitions -->

	<family Dfamily="RA2E2 Series" Dvendor="Renesas:117">
		<processor Dcore="Cortex-M23" DcoreVersion="r1p0-00rel0" Dfpu="NO_FPU" Dmpu="MPU" Ddsp="NO_DSP" Dendian="Little-endian" Dclock="48000000" />
		<description>
The MCU integrates multiple series of software- and pin-compatible Arm®-based 32-bit cores that share a common set of
Renesas peripherals to facilitate design scalability.
The MCU in this series incorporates an energy-efficient Arm Cortex®-M23 32-bit core, that is particularly well suited for
cost-sensitive and low-power applications, with the following features:
● Up to 64-KB code flash memory
● 8 KB SRAM
● 12-bit A/D Converter (ADC12)
● Security features
	</description> 
		<feature type="Timer" 				n="4"	m="32"			name="General PWM Timer (GPT32EH)"/>			
		<feature type="Timer" 				n="4"	m="32"			name="General PWM Timer (GPT32E)"/>
		<feature type="Timer" 				n="5"	m="32"			name="General PWM Timer (GPT32)"/>
		<feature type="Timer"      			n="2"	m="16"			name="Asynchronous General Purpose Timer (AGT)"/>
		<feature type="RTC"     						   			name="Real Time CLock"/>
		<feature type="WDT"					n="1"	m="14"			name="Watchdog Timer (WDT)"/>
		<feature type="WDT"					n="1"	m="14"			name="Independent Watchdog Timer (IWDT)"/>	
		<feature type="ComOther"			n="7"					name="Serial Communications Interface (SCI)"/>	
		<feature type="ComOther"			n="1"					name="Serial Communications Interface (IrDA)"/>	
		<feature type="I2C"					n="2"					name="I2C bus interface (IIC)"/>	
		<feature type="SPI"					n="2"					name="Serial Peripheral Interface (SPI)"/>	
		<feature type="CAN"					n="2"					name="Controller Area Network (CAN)"/>				
		<feature type="ADC"					n="19"	m="12"			name="12-bit A/D Converter (ADC12)"/>	
		<feature type="DAC"					n="1"	m="12"			name="12-bit D/A Converter (DAC12)"/>			
		<feature type="TempSens"			n="1"					name="Temperature Sensor (TSN)"/>	
		<feature type="CoreOther"			n="6"					name="High-Speed Analog Comparator(ACMPHS)"/>			
		<feature type="Touch"				n="12"					name="Capacitive Touch Sensing Unit(CTSU)"/>
		<feature type="CoreOther"			n="1"					name="Cyclic Redundancy Check (CRC) calculator"/>			
		<feature type="CoreOther"			n="1"					name="Data Operation Circuit (DOC)"/>
		<feature type="Crypto"				n="128"					name="AES128 Engine"/>	
		<feature type="Crypto"				n="192"					name="AES192 Engine"/>	
		<feature type="Crypto"				n="256"					name="AES256 Engine"/>	
		<feature type="Crypto"				n="192"					name="3DES Engine"/>
		<feature type="Crypto"				n="2018"				name="ARC4 Engine"/>			
		<feature type="RNG"											name="True Random Number Generator(TRNG)"/>			
		<feature type="Memory"				n="256"					name="Code Flash Kbytes"/>
		<feature type="Memory"				n="32"					name="SRAM Kbytes"/>
		<feature type="Memory"				n="8"					name="Data Flash Kbytes"/>			
		<feature type="PLL"         		n="1"                   name="Internal PLL"/>
		<feature type="VCC"         		n="1.6"   m="5.5"       name="Power Supply Voltage"/>
		<feature type="Temp"        		n="-40"   m="105"       name="Operating Temperature Range"/>
		<feature type="QFP"        			n="100.64"           	name="Leadless Quad Flat Pack (LQFP)"/>
		<feature type="QFN"        			n="64"            		name="Quad-Flat No-leads"/>
		<feature type="XTAL"        		m="120000000"           name="Maximum operating frequency"/>
		<feature type="PLL"        		            				name="5 internal PLLs"/>
		<feature type="DMA"        		    n="8"        			name="DMAC"/>
		<feature type="USBD"       		    n="1"        			name="USB Device "/>
		<feature type="USBH"       		    n="1"        			name="USB Host"/>					
		<debug	svd="SVD/R7FA2E2A7.svd"/>

		<subFamily DsubFamily="RA2E2_64K"> 
			<memory name="Flash"     access="rx" start="0x00000000" size="0x010000" startup="1" default="1"/>
			<memory name="DataFlash" access="r"  start="0x40100000" size="0x000800"/>
			<memory name="ConfigROM" access="r"  start="0x01010000" size="0x34"/>
			<memory name="SRAM1"    access="rwx" start="0x20004000" size="0x002000" init   ="0" default="1"/>
			<algorithm name="Flash/RA2E2_64K.FLM"          	start="0x00000000" size="0x010000" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>
			<algorithm name="Flash/RA2E2_DATA.FLM"          start="0x40100000" size="0x000800" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>
			<algorithm name="Flash/RA2E2_CONF.FLM"          start="0x01010000" size="0x000034" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>
			<device Dname="R7FA2E2A7"/>	
		</subFamily>
		
		<subFamily DsubFamily="RA2E2_32K"> 
			<memory name="Flash"     access="rx" start="0x00000000" size="0x008000" startup="1" default="1"/>
			<memory name="DataFlash" access="r"  start="0x40100000" size="0x000800"/>
			<memory name="ConfigROM" access="r"  start="0x01010000" size="0x34"/>
			<memory name="SRAM1"    access="rwx" start="0x20004000" size="0x002000" init   ="0" default="1"/>
			<algorithm name="Flash/RA2E2_32K.FLM"          	start="0x00000000" size="0x008000" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>
			<algorithm name="Flash/RA2E2_DATA.FLM"          start="0x40100000" size="0x000800" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>
			<algorithm name="Flash/RA2E2_CONF.FLM"          start="0x01010000" size="0x000034" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>
			<device Dname="R7FA2E2A5"/>
		</subFamily>

		<subFamily DsubFamily="RA2E2_16K"> 
			<memory name="Flash"     access="rx" start="0x00000000" size="0x004000" startup="1" default="1"/>
			<memory name="DataFlash" access="r"  start="0x40100000" size="0x000800"/>
			<memory name="ConfigROM" access="r"  start="0x01010000" size="0x34"/>
			<memory name="SRAM1"    access="rwx" start="0x20004000" size="0x002000" init   ="0" default="1"/>
			<algorithm name="Flash/RA2E2_16K.FLM"          	start="0x00000000" size="0x004000" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>
			<algorithm name="Flash/RA2E2_DATA.FLM"          start="0x40100000" size="0x000800" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>
			<algorithm name="Flash/RA2E2_CONF.FLM"          start="0x01010000" size="0x000034" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>		
			<device Dname="R7FA2E2A3"/>
		</subFamily>	
		</family>

	    <!-- RA4M1 Part number definitions -->

