XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Renesas.RA_DFP.pdsc
		<family Dfamily="RA4M1 Series" Dvendor="Renesas:117">
			<processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Ddsp="DSP" Dendian="Little-endian" Dclock="48000000" />
			<description>
The Renesas RA4M1 group of micrcontrollers (MCUs) uses the high-performance Arm® Cortex®-M4 core and offers a segment LCD controller and a capacitive touch sensing unit input for intensive HMI designs. 
The RA4M1 MCU is built on a highly efficient low power process and is supported by an open and flexible ecosystem concept—the Flexible Software Package (FSP), built on FreeRTOS—and is expandable to use other RTOSes and middleware. 
The RA4M1 is suitable for applications where a large amount of capacitive touch channels and a segment LCD controller are required.

Applications

- HMI with Seg/Com LCD display
- Security (fire detection, burglar detection, panel control)
- Industry (door openers, panel control)
- HVAC (heating, air conditioning, boiler control)
- Home appliance 
- General purpose

			</description>
			<feature type="Timer" 				n="2"	m="32"			name="General PWM Timer (GPT)"/>			
			<feature type="Timer" 				n="6"	m="16"			name="General PWM Timer (GPT)"/>
			<feature type="Timer"      			n="2"	m="16"			name="Asynchronous General Purpose Timer (AGT)"/>
			<feature type="RTC"     						   			name="Real Time CLock"/>
			<feature type="WDT"					n="1"	m="14"			name="Watchdog Timer (WDT)"/>
			<feature type="WDT"					n="1"	m="14"			name="Independent Watchdog Timer (IWDT)"/>	
			<feature type="ComOther"			n="4"					name="Serial Communications Interface (SCI)"/>	
			<feature type="I2C"					n="2"					name="I2C bus interface (IIC)"/>	
			<feature type="SPI"					n="2"					name="Serial Peripheral Interface (SPI)"/>	
			<feature type="CAN"					n="1"					name="Controller Area Network (CAN)"/>				
			<feature type="ADC"					n="25"	m="14"			name="14-bit A/D Converter (ADC14)"/>	
			<feature type="DAC"					n="1"	m="12"			name="12-bit D/A Converter (DAC12)"/>			
			<feature type="DAC"					n="2"	m="8"			name="8-bit D/A Converter (DAC8)"/>
			<feature type="TempSens"			n="1"					name="Temperature Sensor (TSN)"/>	
			<feature type="CoreOther"			n="1"					name="High-Speed Analog Comparator(ACMPHS)"/>			
			<feature type="CoreOther"			n="1"					name="Low-Power Analog Comparator(ACMPLP)"/>
			<feature type="Touch"				n="27"					name="Capacitive Touch Sensing Unit(CTSU)"/>
			<feature type="CoreOther"			n="1"					name="Cyclic Redundancy Check (CRC) calculator"/>			
			<feature type="CoreOther"			n="1"					name="Data Operation Circuit (DOC)"/>
			<feature type="Crypto"				n="128.256"				name="AES Engine"/>	
			<feature type="RNG"											name="True Random Number Generator(TRNG)"/>			
			<feature type="Memory"				n="256"					name="Code Flash Kbytes"/>
			<feature type="Memory"				n="32"					name="SRAM Kbytes"/>
			<feature type="Memory"				n="8"					name="Data Flash Kbytes"/>			
			<feature type="PLL"         		n="1"                   name="Internal PLL"/>
			<feature type="VCC"         		n="1.6"   m="5.5"       name="Power Supply Voltage"/>
			<feature type="Temp"        		n="-40"   m="105"       name="Operating Temperature Range"/>
			<feature type="QFP"        			n="100"           		name="Leadless Quad Flat Pack (LQFP100)"/>
			<feature type="QFP"        			n="64"           		name="Leadless Quad Flat Pack (LQFP64)"/>			
			<feature type="QFP"        			n="48"           		name="Leadless Quad Flat Pack (LQFP48)"/>
			<feature type="XTAL"        		m="48000000"            name="Maximum operating frequency"/>
			<feature type="PLL"        		            				name="5 internal PLLs"/>
			<feature type="USBD"       		    n="1"        			name="USB Device "/>
			<feature type="USBH"       		    n="1"        			name="USB Host"/>
			<feature type="DMA"        		    n="4"        			name="DMAC"/>
			<feature type="LCD"       		    n="1"	m="38.4"		name="Segment LCD COntroller (LCDC)"/>							
			<debug	svd="SVD/R7FA4M1AB.svd"/>

			<subFamily DsubFamily="RA4M1_256K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x040000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x40100000" size="0x002000"/>
				<memory name="ConfigROM" access="r"  start="0x01010000" size="0x34"/>
				<memory name="SRAM1"    access="rwx" start="0x20000000" size="0x008000" init   ="0" default="1"/>
				<algorithm name="Flash/RA4M1_256K.FLM"          start="0x00000000" size="0x040000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA4M1_DATA.FLM"    		start="0x40100000" size="0x002000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA4M1_CONF.FLM"          start="0x01010000" size="0x000034" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA4M1AB"/>	
			</subFamily>
		  </family>

	    <!-- RA4M2 Part number definitions -->

		<family Dfamily="RA4M2 Series" Dvendor="Renesas:117">		
			<processor Dcore="Cortex-M33" DcoreVersion="r0p4-00rel1" Dtz="TZ" Dfpu="SP_FPU" Dmpu="MPU" Ddsp="DSP" Dendian="Little-endian" Dclock="100000000" />
			<description>
The RA4M2 Group bridges the needs for reasonable low power with the demand for connectivity and performance. These
MCUs deliver up to 100 MHz of CPU performance using an Arm Cortex-M33 core with up to 512 KB of embedded flash
memory. The RA4M2 Group offers a wide set of peripherals, including USB, CAN, ADC, capacitive touch, and additional
security IP integration, making it suitable for industrial equipment, home appliances, office equipment, healthcare products,
and meters.
			</description>
			<feature type="Timer" 				n="4"	m="32"			name="General PWM Timer (GPT32)"/>			
			<feature type="Timer" 				n="4"	m="16"			name="General PWM Timer (GPT16)"/>
			<feature type="Timer"      			n="6"	m="16"			name="Asynchronous General Purpose Timer (AGT)"/>
			<feature type="RTC"     						   			name="Real Time CLock"/>
			<feature type="WDT"					n="1"	m="14"			name="Watchdog Timer (WDT)"/>
			<feature type="WDT"					n="1"	m="14"			name="Independent Watchdog Timer (IWDT)"/>	
			<feature type="ComOther"			n="6"					name="Serial Communications Interface (SCI)"/>
			<feature type="ComOther"			n="1"					name="Quad Serial Peripheral Interface (QSPI)"/>	
			<feature type="ComOther"			n="1"					name="Serial Sound Interface Enhanced (SSIE)"/>
			<feature type="ComOther"			n="1"					name="SD/MMC Host Interface (SDHI)"/>			
			<feature type="I2C"					n="2"					name="I2C bus interface (IIC)"/>	
			<feature type="SPI"					n="1"					name="Serial Peripheral Interface (SPI)"/>	
			<feature type="CAN"					n="1"					name="Controller Area Network (CAN)"/>		
			<feature type="ADC"					n="13"	m="12"			name="12-bit A/D Converter (ADC12)"/>	
			<feature type="DAC"					n="2"	m="12"			name="12-bit D/A Converter (DAC12)"/>			
			<feature type="TempSens"			n="1"					name="Temperature Sensor (TSN)"/>	
			<feature type="Touch"				n="12"					name="Capacitive Touch Sensing Unit(CTSU)"/>		
			<feature type="Crypto"				n="128"					name="AES128 Engine"/>	
			<feature type="Crypto"				n="192"					name="AES192 Engine"/>	
			<feature type="Crypto"				n="256"					name="AES256 Engine"/>	
			<feature type="Crypto"				n="1024"				name="RSA1024 Engine"/>
			<feature type="Crypto"				n="2048"				name="RSA2048 Engine"/>
			<feature type="Crypto"				n="3072"				name="RSA3072 Engine"/>
			<feature type="Crypto"				n="4096"				name="RSA4096 Engine"/>	
			<feature type="Crypto"				n="1024.160"			name="DSA160 Engine"/>
			<feature type="Crypto"				n="2048.224"			name="DSA224 Engine"/>
			<feature type="Crypto"				n="2048.256"			name="DSA256 Engine"/>	
			<feature type="Crypto"				n="192"					name="ECC NIST P192"/>				
			<feature type="Crypto"				n="224"					name="ECC NIST P224"/>	
			<feature type="Crypto"				n="256"					name="ECC NIST P256"/>	
			<feature type="Crypto"				n="384"					name="ECC NIST P384"/>	
			<feature type="Crypto"				n="256"					name="ECC Branpool 256"/>
			<feature type="Crypto"				n="384"					name="ECC Branpool384"/>			
			<feature type="Crypto"				n="512"					name="ECC Branpool 512"/>	
			<feature type="Crypto"				n="256"					name="SHA 256"/>			
			<feature type="Crypto"				n="224"					name="SHA 224"/>	
			<feature type="RNG"											name="True Random Number Generator(TRNG)"/>				
			<feature type="PLL"         		n="2"                   name="Internal PLL"/>
			<feature type="VCC"         		n="2.7"   m="3.6"       name="Power Supply Voltage"/>
			<feature type="Temp"        		n="-40"   m="105"       name="Operating Temperature Range"/>			
			<feature type="QFP"        			n="100"           		name="LQFP (14 mm × 14 mm, 0.5 mm pitch)"/>
			<feature type="QFP"        			n="64"           		name="LQFP (10 mm × 10 mm, 0.5 mm pitch)"/>	
			<feature type="QFP"        			n="48"           		name="LQFP (7 mm × 7 mm, 0.5 mm pitch)"/>	
			<feature type="QFN"        			n="48"           		name="LQFP (7 mm × 7 mm, 0.5 mm pitch)"/>				
			<feature type="XTAL"        		m="100000000"           name="Maximum operating frequency"/>
			<feature type="ClockOther"        		            		name="5 independant clock sources"/>
			<feature type="DMA"        		    n="8"        			name="DMAC"/>
			<feature type="USBD"       		    n="1"        			name="USB 2.0 Full-Speed Module (USBFS)"/>
			<feature type="USBH"       		    n="1"        			name="USB 2.0 Full-Speed Module (USBFS)"/>					
			
			<debug	svd="SVD/R7FA4M2AD.svd">
			  <datapatch  __dp="0" __ap="0" address="0xE0040FCC" value="0x11" info="DEVTYPE"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FF0" value="0x0D" info="CIDR0"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FF4" value="0x90" info="CIDR1"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FF8" value="0x05" info="CIDR2"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FFC" value="0xB1" info="CIDR3"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FD0" value="0x04" info="PIDR4"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FD4" value="0x00" info="PIDR5"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FD8" value="0x00" info="PIDR6"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FDC" value="0x00" info="PIDR7"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FE0" value="0x21" info="PIDR0"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FE4" value="0xBD" info="PIDR1"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FE8" value="0x0B" info="PIDR2"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FEC" value="0x00" info="PIDR3 (ECOREVNUM)"/>
            </debug>

			<debugvars configfile="Debug/RA4M2.dbgconf">
              __var TRCK_value      = 0x00000001;   // Trace Clock operating frequency /1
            </debugvars>

