XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Renesas.RA_DFP.pdsc
            <sequences>
              <sequence name="EnableTraceClock">
                <block>
                  Write16( 0x4001E3FE, 0xA501 ) ;  // set PRCR, bit PRC0
                  Write8( 0x4001E03F, 0x80 | TRCK_value ) ;  // set TRCKCR, bit TRCKEN and TRCK[]
                  Write16( 0x4001E3FE, 0xA500 ) ;  // clear PRCR, bit PRC0
                </block>
              </sequence>

              <sequence name="DebugDeviceUnlock">
                <block>
                  __var trace_enabled = ( __traceout &amp; 0x3 ) != 0 ; // TPIU or SWO Trace Selected?
                </block>

                <control if="trace_enabled">
                  <block>
                    Sequence("EnableTraceClock");
                  </block>
                </control>
              </sequence>

              <sequence name="ConfigureTraceTPIUPins">
                <block>
                  __var parallel_trace_port_size = ( __traceout &amp; 0x003F0000 ) &gt;&gt; 16 ;
                  Write8( 0x40080D03, 0x00 ) ;  // clear PWPR, bit B0WI
                  Write8( 0x40080D03, 0x40 ) ;  // set PWPR, bit PFSWE
                  Write32( 0x400808B8, 0x1A010C00 ) ;  // P214: TCLK
                </block>

                <control if="parallel_trace_port_size &gt;= 1" info="TPIU port width 1">
                  <block info="configure Trace I/O Enable + Trace Mode Synchronous 1 bit">
                    Write32( 0x400808AC, 0x1A010C00 ) ;  // P211: TDATA0
                  </block>
                </control>
                <control if="parallel_trace_port_size &gt;= 2" info="TPIU port width 2">
                  <block info="configure Trace I/O Enable + Trace Mode Synchronous 2 bit">
                    Write32( 0x400808A8, 0x1A010C00 ) ;  // P210: TDATA1
                  </block>
                </control>
                <control if="parallel_trace_port_size &gt;= 4" info="TPIU port width 4">
                  <block info="configure Trace I/O Enable + Trace Mode Synchronous 4 bit">
                    Write32( 0x400808A4, 0x1A010C00 ) ;  // P209: TDATA2
                    Write32( 0x400808A0, 0x1A010C00 ) ;  // P208: TDATA3
                  </block>
                </control>
                <block>
                  Write8( 0x40080D03, 0x00);  // clear PWPR, bit PFSWE
                  Write8( 0x40080D03, 0x80);  // set PWPR, bit B0WI
                </block>
              </sequence>

              <sequence name="TraceStart ">
                <block>
                  __var tpiu_trace_enabled = ( __traceout &amp; 0x2 ) != 0 ; // TPIU Trace Selected?
                  Sequence( "EnableTraceClock" ) ;
                </block>
                <control if="tpiu_trace_enabled">
                  <block>
                    Sequence( "ConfigureTraceTPIUPins" ) ;
                  </block>
                </control>
              </sequence>
            </sequences>

			<subFamily DsubFamily="RA4M3_1M">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x100000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x08000000" size="0x002000"/>
				<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x000300"/>
				<memory name="SRAM1"    access="rwx" start="0x20000000" size="0x020000" init   ="0" default="1"/>
				<algorithm name="Flash/RA4M3_1M.FLM"            start="0x00000000" size="0x100000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA4M3_DATA_C1M.FLM"      start="0x08000000" size="0x002000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA4M3_CONF.FLM"          start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA4M3AF" />				
			</subFamily>

			<subFamily DsubFamily="RA4M3_768K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x0C0000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x08000000" size="0x002000"/>
				<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x000300"/>
				<memory name="SRAM1"    access="rwx" start="0x20000000" size="0x020000" init   ="0" default="1"/>
				<algorithm name="Flash/RA4M3_768K.FLM"          start="0x00000000" size="0x0C0000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA4M3_DATA_C768K.FLM"    start="0x08000000" size="0x002000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA4M3_CONF.FLM"          start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA4M3AE"/>
			</subFamily>		

			<subFamily DsubFamily="RA4M3_512K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x080000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x08000000" size="0x002000"/>
				<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x000300"/>
				<memory name="SRAM1"    access="rwx" start="0x20000000" size="0x020000" init   ="0" default="1"/>
				<algorithm name="Flash/RA4M3_512K.FLM"          start="0x00000000" size="0x080000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA4M3_DATA_C512K.FLM"    start="0x08000000" size="0x002000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA4M3_CONF.FLM"          start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA4M3AD" />
			</subFamily>
	
		  </family>

		<!-- RA4W1 Part number definitions -->

		<family Dfamily="RA4W1 Series" Dvendor="Renesas:117">
			<processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Ddsp="DSP" Dendian="Little-endian" Dclock="48000000" />
			<description>
The Renesas RA4W1 is the first Bluetooth® 5.0 Low Energy fully compliant with 2Mbit High-Throughput (HT) and Long Range support in a single chip MCU of Renesas RA4 product series for IoT applications that require a high-performance Arm® Cortex®-M4 core at a very attractive price point. 
The RA4W1 is built on a highly efficient low power process and is supported by an open and flexible ecosystem concept, called Flexible Software Package (FSP), using FreeRTOS as base. 
RA4W1 is geared towards IoT application requiring Security, large embedded RAM and low power consumption.

Highlights
-    48MHz Arm® Cortex®-M4
-    512kB Flash Memory and 96kB SRAM
-    8kB Data Flash to store data as in EEPROM
-    7x7 mm QFN 56-pin package
-    Capacitive touch sensing unit
-    Segment LCD controller
-    USB 2.0 Full Speed module supporting host and device mode
-    CAN 2.0B
-    SCI (UART, Simple SPI, Simple I2C)
-    SPI/ I2C multimaster interface
-    2.4 GHz radio with Bluetooth 5.0 Low Energy
-    LE 1M, 2M, Coded PHY, and LE advertising extension
-    Secure Crypto Engine (AES128 / 256, GHASH, TRNG)
			</description>
			<feature type="Timer" 				n="4"	m="32"			name="General PWM Timer (GPT)"/>			
			<feature type="Timer" 				n="3"	m="16"			name="General PWM Timer (GPT)"/>
			<feature type="Timer"      			n="2"	m="16"			name="Asynchronous General Purpose Timer (AGT)"/>
			<feature type="WDT"					n="1"	m="14"			name="Watchdog Timer (WDT)"/>
			<feature type="ComOther"			n="4"					name="Serial Communications Interface (SCI)"/>	
			<feature type="I2C"					n="2"					name="I2C bus interface (IIC)"/>	
			<feature type="SPI"					n="2"					name="Serial Peripheral Interface (SPI)"/>	
			<feature type="CAN"					n="1"					name="Controller Area Network (CAN)"/>				
			<feature type="ADC"					n="8"	m="14"			name="14-bit A/D Converter (ADC14)"/>				
			<feature type="DAC"					n="1"	m="12"			name="12-bit D/A Converter (DAC12)"/>
			<feature type="TempSens"			n="1"					name="Temperature Sensor (TSN)"/>	
			<feature type="CoreOther"			n="1"					name="OPAMP"/>
			<feature type="Touch"				n="11"					name="Capacitive Touch Sensing Unit(CTSU)"/>
			<feature type="CoreOther"			n="1"					name="Cyclic Redundancy Check (CRC) calculator"/>			
			<feature type="CoreOther"			n="1"					name="Data Operation Circuit (DOC)"/>
			<feature type="Crypto"				n="128"					name="AES128 Engine"/>	
			<feature type="Crypto"				n="256"					name="AES256 Engine"/>	
			<feature type="RNG"											name="True Random Number Generator(TRNG)"/>			
			<feature type="Memory"				n="512"					name="Code Flash KB"/>
			<feature type="Memory"				n="96"					name="SRAM KB"/>
			<feature type="Memory"				n="8"					name="Data Flash KB"/>			
			<feature type="PLL"         		n="1"                   name="Internal PLL"/>
			<feature type="VCC"         		n="1.8"   m="3.6"       name="Power Supply Voltage"/>
			<feature type="Temp"        		n="-40"   m="85"       	name="Operating Temperature Range"/>
			<feature type="QFN"        			n="56"            		name="Quad-Flat No-leads"/>
			<feature type="XTAL"        		m="48000000"            name="Maximum operating frequency"/>
			<feature type="PLL"        		            				name="5 internal PLLs"/>
			<feature type="USBD"       		    n="1"        			name="USB Device "/>
			<feature type="DMA"        		    n="4"        			name="DMAC"/>
			<feature type="LCD"       		    n="1"	m="9.4"			name="Segment LCD COntroller (LCDC)"/>				
			<debug	svd="SVD/R7FA4W1AD.svd"/>
			
			<subFamily DsubFamily="RA4W1_512K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x080000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x40100000" size="0x002000"/>
				<memory name="ConfigROM" access="r"  start="0x01010000" size="0x34"/>
				<memory name="SRAM1"    access="rwx" start="0x20000000" size="0x008000" init   ="0" default="1"/>
				<algorithm name="Flash/RA4W1_512K.FLM"          start="0x00000000" size="0x080000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA4W1_DATA.FLM"    		start="0x40100000" size="0x002000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA4W1_CONF.FLM"          start="0x01010000" size="0x000034" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA4W1AD"/>
			</subFamily>			
		</family>

		<!-- RA4E1 Part number definitions -->

		<family Dfamily="RA4E1 Series" Dvendor="Renesas:117">

			<processor Dcore="Cortex-M33" DcoreVersion="r0p4-00rel0" Dtz="TZ" Dfpu="SP_FPU" Dmpu="MPU" Ddsp="DSP" Dendian="Little-endian" Dclock="100000000" />
			<description>
The MCU integrates multiple series of software-compatible Arm®-based 32-bit cores that share a common set of Renesas
peripherals to facilitate design scalability and efficient platform-based product development.
The MCU in this series incorporates a high-performance Arm Cortex®-M33 core running up to 100 MHz with the following
features:
- Up to 512 KB code flash memory
- 128 KB SRAM
- Quad Serial Peripheral Interface (QSPI)
- USBFS
- Analog peripherals
- Security and safety features

			</description> 
			<feature type="Timer" 				n="4"	m="32"			name="General PWM Timer (GPT32)"/>			
			<feature type="Timer" 				n="6"	m="16"			name="General PWM Timer (GPT16)"/>
			<feature type="Timer"      			n="6"	m="16"			name="Asynchronous General Purpose Timer (AGT)"/>
			<feature type="RTC"     						   			name="Real Time CLock"/>
			<feature type="WDT"					n="1"	m="14"			name="Watchdog Timer (WDT)"/>
			<feature type="WDT"					n="1"	m="14"			name="Independent Watchdog Timer (IWDT)"/>	
			<feature type="CAN" 				n="2" 					name="CAN FD Controller"/>
			<feature type="ComOther"			n="10"					name="Serial Communications Interface (SCI)"/>
			<feature type="ComOther"			n="1"					name="Quad Serial Peripheral Interface (QSPI)"/>	
			<feature type="ComOther"			n="1"					name="Octa Serial Peripheral Interface (OSPI)"/>
			<feature type="ComOther"			n="1"					name="Serial Communications Interface (IrDA)"/>	
			<feature type="ComOther"			n="1"					name="Serial Sound Interface Enhanced (SSIE)"/>
			<feature type="ComOther"			n="1"					name="SD/MMC Host Interface (SDHI)"/>			
			<feature type="I2C"					n="2"					name="I2C bus interface (IIC)"/>	
			<feature type="SPI"					n="2"					name="Serial Peripheral Interface (SPI)"/>	
			<feature type="CAN"					n="2"					name="Controller Area Network (CAN)"/>		
			<feature type="ADC"					n="22"	m="12"			name="12-bit A/D Converter (ADC12)"/>	
			<feature type="DAC"					n="2"	m="12"			name="12-bit D/A Converter (DAC12)"/>			
			<feature type="TempSens"			n="1"					name="Temperature Sensor (TSN)"/>	
			<feature type="Touch"				n="20"					name="Capacitive Touch Sensing Unit(CTSU)"/>		
			<feature type="Crypto"				n="128"					name="AES128 Engine"/>	
			<feature type="Crypto"				n="192"					name="AES192 Engine"/>	
			<feature type="Crypto"				n="256"					name="AES256 Engine"/>	
			<feature type="Crypto"				n="1024"				name="RSA1024 Engine"/>
			<feature type="Crypto"				n="2048"				name="RSA2048 Engine"/>
			<feature type="Crypto"				n="3072"				name="RSA3072 Engine"/>
			<feature type="Crypto"				n="4096"				name="RSA4096 Engine"/>	
			<feature type="Crypto"				n="1024.160"			name="DSA160 Engine"/>
			<feature type="Crypto"				n="2048.224"			name="DSA224 Engine"/>
			<feature type="Crypto"				n="2048.256"			name="DSA256 Engine"/>	
			<feature type="Crypto"				n="192"					name="ECC NIST P192"/>				
			<feature type="Crypto"				n="224"					name="ECC NIST P224"/>	
			<feature type="Crypto"				n="256"					name="ECC NIST P256"/>	
			<feature type="Crypto"				n="384"					name="ECC NIST P384"/>	
			<feature type="Crypto"				n="256"					name="ECC Branpool 256"/>
			<feature type="Crypto"				n="384"					name="ECC Branpool384"/>			
			<feature type="Crypto"				n="512"					name="ECC Branpool 512"/>	
			<feature type="Crypto"				n="384"					name="SHA 384"/>			
			<feature type="Crypto"				n="224"					name="SHA 224"/>	
			<feature type="RNG"											name="True Random Number Generator(TRNG)"/>				
			<feature type="PLL"         		n="2"                   name="Internal PLL"/>
			<feature type="VCC"         		n="2.7"   m="3.6"       name="Power Supply Voltage"/>
			<feature type="Temp"        		n="-40"   m="105"       name="Operating Temperature Range"/>			
			<feature type="QFP"        			n="144"           		name="LQFP (20 mm × 20 mm, 0.5 mm pitch)"/>
			<feature type="QFP"        			n="100"           		name="LQFP (14 mm × 14 mm, 0.5 mm pitch)"/>
			<feature type="QFP"        			n="64"           		name="LQFP (10 mm × 10 mm, 0.5 mm pitch)"/>			
			<feature type="XTAL"        		m="200000000"           name="Maximum operating frequency"/>
			<feature type="ClockOther"        		            		name="5 independant clock sources"/>
			<feature type="DMA"        		    n="8"        			name="DMAC"/>
			<feature type="USBD"       		    n="1"        			name="USB 2.0 Full-Speed Module (USBFS)"/>
			<feature type="USBH"       		    n="1"        			name="USB 2.0 Full-Speed Module (USBFS)"/>
			<feature type="ETH"       		    n="1"        			name="Ethernet MAC/DMA Controller (ETHERC/EDMAC)"/>			            				
			<debug	svd="SVD/R7FA4E10D.svd"/>

			<subFamily DsubFamily="RA4E1_512K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x080000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x08000000" size="0x002000"/>
				<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x000300"/>
				<memory name="SRAM1"    access="rwx" start="0x20000000" size="0x020000" init   ="0" default="1"/>
				<algorithm name="Flash/RA4E1_512K.FLM"          start="0x00000000" size="0x080000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA4E1_DATA_C512K.FLM"    start="0x08000000" size="0x002000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA4E1_CONF.FLM"          start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA4E10D"/>	
			</subFamily>			
		
			<subFamily DsubFamily="RA4E1_256K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x040000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x08000000" size="0x002000"/>
				<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x000300"/>
				<memory name="SRAM1"    access="rwx" start="0x20000000" size="0x020000" init   ="0" default="1"/>
				<algorithm name="Flash/RA4E1_256K.FLM"          start="0x00000000" size="0x040000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA4E1_DATA_C256K.FLM"    start="0x08000000" size="0x002000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA4E1_CONF.FLM"          start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA4E10B"/>
			</subFamily>			
		</family>	

