XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Renesas.RA_DFP.pdsc
	    <!-- RA6M1 Part number definitions -->

		<family Dfamily="RA6M1 Series" Dvendor="Renesas:117">
			<processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Ddsp="DSP" Dendian="Little-endian" Dclock="120000000" />
			<description>
The Renesas RA6M1 microcontroller is the entry point to the Renesas RA6 product series for applications that require a high-performance Arm® Cortex®-M4 core at a very attractive price point. 
The RA6M1 is built on a highly efficient 40nm process and is supported by an open and flexible ecosystem concept—the Flexible Software Package (FSP), built on FreeRTOS—and is expandable to use other RTOSes 
and middleware. 
The RA6M1 is suitable for IoT applications requiring security, large embedded RAM and low power consumption.

Applications

- Security (fire detection, burglar detection, panel control)
- Metering (electricity, automated meter reading)
- Industry (robotics, door openers, sewing machines, vending machines, UPS)
- HVAC (heating, air conditioning, boiler control)
- General purpose

			</description>
			<feature type="Timer" 				n="4"	m="32"			name="General PWM Timer (GPT32EH)"/>			
			<feature type="Timer" 				n="4"	m="32"			name="General PWM Timer (GPT32E)"/>
			<feature type="Timer" 				n="5"	m="32"			name="General PWM Timer (GPT32)"/>
			<feature type="Timer"      			n="2"	m="16"			name="Asynchronous General Purpose Timer (AGT)"/>
			<feature type="RTC"     						   			name="Real Time CLock"/>
			<feature type="WDT"					n="1"	m="14"			name="Watchdog Timer (WDT)"/>
			<feature type="WDT"					n="1"	m="14"			name="Independent Watchdog Timer (IWDT)"/>	
			<feature type="ComOther"			n="7"					name="Serial Communications Interface (SCI)"/>	
			<feature type="ComOther"			n="1"					name="Serial Communications Interface (IrDA)"/>	
			<feature type="I2C"					n="2"					name="I2C bus interface (IIC)"/>	
			<feature type="SPI"					n="2"					name="Serial Peripheral Interface (SPI)"/>	
			<feature type="CAN"					n="2"					name="Controller Area Network (CAN)"/>				
			<feature type="ADC"					n="19"	m="12"			name="12-bit A/D Converter (ADC12)"/>	
			<feature type="DAC"					n="1"	m="12"			name="12-bit D/A Converter (DAC12)"/>			
			<feature type="TempSens"			n="1"					name="Temperature Sensor (TSN)"/>	
			<feature type="CoreOther"			n="6"					name="High-Speed Analog Comparator(ACMPHS)"/>			
			<feature type="Touch"				n="12"					name="Capacitive Touch Sensing Unit(CTSU)"/>
			<feature type="CoreOther"			n="1"					name="Cyclic Redundancy Check (CRC) calculator"/>			
			<feature type="CoreOther"			n="1"					name="Data Operation Circuit (DOC)"/>
			<feature type="Crypto"				n="128"					name="AES128 Engine"/>	
			<feature type="Crypto"				n="192"					name="AES192 Engine"/>	
			<feature type="Crypto"				n="256"					name="AES256 Engine"/>	
			<feature type="Crypto"				n="192"					name="3DES Engine"/>
			<feature type="Crypto"				n="2018"				name="ARC4 Engine"/>			
			<feature type="RNG"											name="True Random Number Generator(TRNG)"/>			
			<feature type="Memory"				n="256"					name="Code Flash Kbytes"/>
			<feature type="Memory"				n="32"					name="SRAM Kbytes"/>
			<feature type="Memory"				n="8"					name="Data Flash Kbytes"/>			
			<feature type="PLL"         		n="1"                   name="Internal PLL"/>
			<feature type="VCC"         		n="1.6"   m="5.5"       name="Power Supply Voltage"/>
			<feature type="Temp"        		n="-40"   m="105"       name="Operating Temperature Range"/>
			<feature type="QFP"        			n="100.64"           	name="Leadless Quad Flat Pack (LQFP)"/>
			<feature type="QFN"        			n="64"            		name="Quad-Flat No-leads"/>
			<feature type="XTAL"        		m="120000000"           name="Maximum operating frequency"/>
			<feature type="PLL"        		            				name="5 internal PLLs"/>
			<feature type="DMA"        		    n="8"        			name="DMAC"/>
			<feature type="USBD"       		    n="1"        			name="USB Device "/>
			<feature type="USBH"       		    n="1"        			name="USB Host"/>					
			<debug	svd="SVD/R7FA6M1AD.svd"/>

			<subFamily DsubFamily="RA6M1_512K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x080000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x40100000" size="0x002000"/>
				<memory name="ConfigROM" access="r"  start="0x0100A100" size="0x80"/>
				<memory name="SRAM1"    access="rwx" start="0x1FFE0000" size="0x020000" init   ="0" default="0"/>
				<memory name="SRAM2"    access="rwx" start="0x20000000" size="0x020000" init   ="0" default="1"/>
				<algorithm name="Flash/RA6M1_512K.FLM"          start="0x00000000" size="0x080000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6M1_DATA.FLM"          start="0x40100000" size="0x002000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6M1_CONF.FLM"          start="0x0100A100" size="0x000080" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA6M1AD"/>	
			</subFamily>			
			</family>
	
		<!-- RA6M2 Part number definitions -->

		<family Dfamily="RA6M2 Series" Dvendor="Renesas:117">
			<processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Ddsp="DSP" Dendian="Little-endian" Dclock="120000000" />
			<description>
The Renesas RA6M2 group of microcontrollers (MCUs) uses the high-performance Arm® Cortex®-M4 core and offers Ethernet MAC with individual DMA, to ensure high data throughput. 
The RA6M2 is built on a highly efficient 40nm process and is supported by an open and flexible ecosystem concept—the Flexible Software Package (FSP), built on FreeRTOS—and is expandable to use other 
RTOSes and middleware. 
The RA6M2 is suitable for IoT applications requiring Ethernet, security, large embedded RAM, and low active power consumption.


Applications

- Wired Ethernet applications
- Security (fire detection, burglar detection, panel control)
- Metering (electricity, automated meter reading)
- Industry (robotics, door openers, sewing machines, vending machines, UPS)
- HVAC (heating, air conditioning, boiler control)
- General purpose

			</description>
			<feature type="Timer" 				n="4"	m="32"			name="General PWM Timer (GPT32EH)"/>			
			<feature type="Timer" 				n="4"	m="32"			name="General PWM Timer (GPT32E)"/>
			<feature type="Timer" 				n="6"	m="32"			name="General PWM Timer (GPT32)"/>
			<feature type="Timer"      			n="2"	m="16"			name="Asynchronous General Purpose Timer (AGT)"/>
			<feature type="RTC"     						   			name="Real Time CLock"/>
			<feature type="WDT"					n="1"	m="14"			name="Watchdog Timer (WDT)"/>
			<feature type="WDT"					n="1"	m="14"			name="Independent Watchdog Timer (IWDT)"/>	
			<feature type="ComOther"			n="10"					name="Serial Communications Interface (SCI)"/>	
			<feature type="ComOther"			n="1"					name="Serial Communications Interface (IrDA)"/>	
			<feature type="I2C"					n="2"					name="I2C bus interface (IIC)"/>	
			<feature type="SPI"					n="2"					name="Serial Peripheral Interface (SPI)"/>	
			<feature type="CAN"					n="2"					name="Controller Area Network (CAN)"/>				
			<feature type="ADC"					n="22"	m="12"			name="12-bit A/D Converter (ADC12)"/>	
			<feature type="DAC"					n="2"	m="12"			name="12-bit D/A Converter (DAC12)"/>			
			<feature type="TempSens"			n="1"					name="Temperature Sensor (TSN)"/>	
			<feature type="CoreOther"			n="6"					name="High-Speed Analog Comparator(ACMPHS)"/>			
			<feature type="Touch"				n="18"					name="Capacitive Touch Sensing Unit(CTSU)"/>
			<feature type="CoreOther"			n="1"					name="Cyclic Redundancy Check (CRC) calculator"/>			
			<feature type="CoreOther"			n="1"					name="Data Operation Circuit (DOC)"/>
			<feature type="Crypto"				n="128"					name="AES128 Engine"/>	
			<feature type="Crypto"				n="192"					name="AES192 Engine"/>	
			<feature type="Crypto"				n="256"					name="AES256 Engine"/>	
			<feature type="Crypto"				n="192"					name="3DES Engine"/>
			<feature type="Crypto"				n="2018"				name="ARC4 Engine"/>			
			<feature type="RNG"											name="True Random Number Generator(TRNG)"/>			
			<feature type="PLL"         		n="1"                   name="Internal PLL"/>
			<feature type="VCC"         		n="1.6"   m="5.5"       name="Power Supply Voltage"/>
			<feature type="Temp"        		n="-40"   m="105"       name="Operating Temperature Range"/>
			<feature type="QFP"        			n="14.100"           	name="Leadless Quad Flat Pack (LQFP)"/>
			<feature type="XTAL"        		m="120000000"           name="Maximum operating frequency"/>
			<feature type="PLL"        		            				name="5 internal PLLs"/>
			<feature type="DMA"        		    n="8"        			name="DMAC"/>
			<feature type="USBD"       		    n="1"        			name="USB Device "/>
			<feature type="USBH"       		    n="1"        			name="USB Host"/>
			<feature type="ETH"       		    n="1"        			name="Ethernet controller"/>							
			<debug	svd="SVD/R7FA6M2AF.svd"/>


			<subFamily DsubFamily="RA6M2_1M">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x100000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x40100000" size="0x008000"/>
				<memory name="ConfigROM" access="r"  start="0x0100A100" size="0x80"/>
				<memory name="SRAM1"    access="rwx" start="0x1FFE0000" size="0x020000" init   ="0" default="0"/>
				<memory name="SRAM2"    access="rwx" start="0x20000000" size="0x040000" init   ="0" default="1"/>
				<algorithm name="Flash/RA6M2_1M.FLM"            start="0x00000000" size="0x100000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6M2_DATA_C1M.FLM"      start="0x40100000" size="0x008000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6M2_CONF.FLM"          start="0x0100A100" size="0x000080" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA6M2AF"/>	
			</subFamily>			

