XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Renesas.RA_DFP.pdsc
			<subFamily DsubFamily="RA6M4_768K">
				<device Dname="R7FA6M4AE">
					<memory name="Flash"     access="rx" start="0x00000000" size="0x0C0000" startup="1" default="1"/>
					<memory name="DataFlash" access="r"  start="0x08000000" size="0x002000"/>
					<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x300"/>
					<memory name="SRAM1"    access="rwx" start="0x20000000" size="0x040000" init   ="0" default="1"/>
					<algorithm name="Flash/RA6M4_768K.FLM"          start="0x00000000" size="0x0C0000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
					<algorithm name="Flash/RA6M4_DATA_C768K.FLM"    start="0x08000000" size="0x002000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
					<algorithm name="Flash/RA6M4_CONF.FLM"          start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				</device>
				
				<device Dname="R7FA6M4AE_dual">
					<memory name="Flash_Lower"           access="rx"        start="0"          size="0x060000" startup="1" default="1"/>
					<memory name="Flash_Upper"           access="rx"        start="0x00200000" size="0x060000"/>
					<memory name="DataFlash" access="r"  start="0x08000000" size="0x002000"/>
					<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x300"/>
					<memory name="SRAM1"    access="rwx" start="0x20000000" size="0x040000" init   ="0" default="1"/>
					<algorithm name="Flash/RA6M4_768K_DL.FLM"       start="0x00000000" size="0x060000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
					<algorithm name="Flash/RA6M4_768K_DU.FLM"       start="0x00200000" size="0x060000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
					<algorithm name="Flash/RA6M4_DATA_C768K_D.FLM"  start="0x08000000" size="0x002000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
					<algorithm name="Flash/RA6M4_CONF.FLM"          start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				</device>
					
			</subFamily>

			<subFamily DsubFamily="RA6M4_512K">
				<device Dname="R7FA6M4AD">	
					<memory name="Flash"     access="rx" start="0x00000000" size="0x080000" startup="1" default="1"/>
					<memory name="DataFlash" access="r"  start="0x08000000" size="0x002000"/>
					<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x300"/>
					<memory name="SRAM1"    access="rwx" start="0x20000000" size="0x040000" init   ="0" default="1"/>
					<algorithm name="Flash/RA6M4_512K.FLM"          start="0x00000000" size="0x080000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
					<algorithm name="Flash/RA6M4_DATA_C512K.FLM"    start="0x08000000" size="0x002000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
					<algorithm name="Flash/RA6M4_CONF.FLM"          start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				</device>	
				
				<device Dname="R7FA6M4AD_dual">
					<memory name="Flash_Lower"           access="rx"        start="0"          size="0x040000" startup="1" default="1"/>
					<memory name="Flash_Upper"           access="rx"        start="0x00200000" size="0x040000"/>
					<memory name="DataFlash" access="r"  start="0x08000000" size="0x002000"/>
					<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x300"/>
					<memory name="SRAM1"    access="rwx" start="0x20000000" size="0x040000" init   ="0" default="1"/>
					<algorithm name="Flash/RA6M4_512K_DL.FLM"       start="0x00000000" size="0x040000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
					<algorithm name="Flash/RA6M4_512K_DU.FLM"       start="0x00200000" size="0x040000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
					<algorithm name="Flash/RA6M4_DATA_C512K_D.FLM"  start="0x08000000" size="0x002000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
					<algorithm name="Flash/RA6M4_CONF.FLM"          start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				</device>
				
			</subFamily>
		
			</family>

	    <!-- RA6M5 Part number definitions -->

		<family Dfamily="RA6M5 Series" Dvendor="Renesas:117">
			<processor Dcore="Cortex-M33" DcoreVersion="r0p4-00rel1" Dtz="TZ" Dfpu="SP_FPU" Dmpu="MPU" Ddsp="DSP" Dendian="Little-endian" Dclock="200000000" />
			<description>
The RA6M5 Group offers the widest integration of communication interfaces as well as the best performance level. These
MCUs deliver up to 200 MHz of CPU performance using an Arm Cortex-M33 core and a memory range from 1 MB to 2 MB
Flash. The group offers Ethernet, USB, CANFD, QSPI, OSPI, CEC integration. And, its embedded Secure Crypto Engine is
full of features you can leverage in your higher-level solutions. The RA6M5 Group addresses a broad range of applications
for IoT endpoints such as white goods, meters, and other industrial and consumer applications.

Applications

-Wired Ethernet applications
-Enhanced Security (fire detection, burglar detection, panel control)
-Metering (electricity, automated meter reading)
-Industry (robotics, door openers, sewing machines, vending machines, UPS)
-HVAC (heating, air conditioning, boiler control)
-General purpose

			</description>
			<feature type="Timer" 				n="4"	m="32"			name="General PWM Timer (GPT32)"/>			
			<feature type="Timer" 				n="6"	m="16"			name="General PWM Timer (GPT16)"/>
			<feature type="Timer"      			n="6"	m="16"			name="Asynchronous General Purpose Timer (AGT)"/>
			<feature type="RTC"     						   			name="Real Time CLock"/>
			<feature type="WDT"					n="1"	m="14"			name="Watchdog Timer (WDT)"/>
			<feature type="WDT"					n="1"	m="14"			name="Independent Watchdog Timer (IWDT)"/>	
			<feature type="CAN" 				n="2" 					name="CAN FD Controller"/>
			<feature type="ComOther"			n="10"					name="Serial Communications Interface (SCI)"/>
			<feature type="ComOther"			n="1"					name="Quad Serial Peripheral Interface (QSPI)"/>	
			<feature type="ComOther"			n="1"					name="Octa Serial Peripheral Interface (OSPI)"/>
			<feature type="ComOther"			n="1"					name="Serial Communications Interface (IrDA)"/>	
			<feature type="ComOther"			n="1"					name="Serial Sound Interface Enhanced (SSIE)"/>
			<feature type="ComOther"			n="1"					name="SD/MMC Host Interface (SDHI)"/>			
			<feature type="I2C"					n="2"					name="I2C bus interface (IIC)"/>	
			<feature type="SPI"					n="2"					name="Serial Peripheral Interface (SPI)"/>	
			<feature type="CAN"					n="2"					name="Controller Area Network (CAN)"/>		
			<feature type="ADC"					n="22"	m="12"			name="12-bit A/D Converter (ADC12)"/>	
			<feature type="DAC"					n="2"	m="12"			name="12-bit D/A Converter (DAC12)"/>			
			<feature type="TempSens"			n="1"					name="Temperature Sensor (TSN)"/>	
			<feature type="Touch"				n="20"					name="Capacitive Touch Sensing Unit(CTSU)"/>		
			<feature type="Crypto"				n="128"					name="AES128 Engine"/>	
			<feature type="Crypto"				n="192"					name="AES192 Engine"/>	
			<feature type="Crypto"				n="256"					name="AES256 Engine"/>	
			<feature type="Crypto"				n="1024"				name="RSA1024 Engine"/>
			<feature type="Crypto"				n="2048"				name="RSA2048 Engine"/>
			<feature type="Crypto"				n="3072"				name="RSA3072 Engine"/>
			<feature type="Crypto"				n="4096"				name="RSA4096 Engine"/>	
			<feature type="Crypto"				n="1024.160"			name="DSA160 Engine"/>
			<feature type="Crypto"				n="2048.224"			name="DSA224 Engine"/>
			<feature type="Crypto"				n="2048.256"			name="DSA256 Engine"/>	
			<feature type="Crypto"				n="192"					name="ECC NIST P192"/>				
			<feature type="Crypto"				n="224"					name="ECC NIST P224"/>	
			<feature type="Crypto"				n="256"					name="ECC NIST P256"/>	
			<feature type="Crypto"				n="384"					name="ECC NIST P384"/>	
			<feature type="Crypto"				n="256"					name="ECC Branpool 256"/>
			<feature type="Crypto"				n="384"					name="ECC Branpool384"/>			
			<feature type="Crypto"				n="512"					name="ECC Branpool 512"/>	
			<feature type="Crypto"				n="384"					name="SHA 384"/>			
			<feature type="Crypto"				n="224"					name="SHA 224"/>	
			<feature type="RNG"											name="True Random Number Generator(TRNG)"/>				
			<feature type="PLL"         		n="2"                   name="Internal PLL"/>
			<feature type="VCC"         		n="2.7"   m="3.6"       name="Power Supply Voltage"/>
			<feature type="Temp"        		n="-40"   m="105"       name="Operating Temperature Range"/>			
			<feature type="QFP"        			n="144"           		name="LQFP (20 mm × 20 mm, 0.5 mm pitch)"/>
			<feature type="QFP"        			n="100"           		name="LQFP (14 mm × 14 mm, 0.5 mm pitch)"/>
			<feature type="QFP"        			n="64"           		name="LQFP (10 mm × 10 mm, 0.5 mm pitch)"/>			
			<feature type="XTAL"        		m="200000000"           name="Maximum operating frequency"/>
			<feature type="ClockOther"        		            		name="5 independant clock sources"/>
			<feature type="DMA"        		    n="8"        			name="DMAC"/>
			<feature type="USBD"       		    n="1"        			name="USB 2.0 Full-Speed Module (USBFS)"/>
			<feature type="USBH"       		    n="1"        			name="USB 2.0 Full-Speed Module (USBFS)"/>
			<feature type="ETH"       		    n="1"        			name="Ethernet MAC/DMA Controller (ETHERC/EDMAC)"/>							

			<debug	svd="SVD/R7FA6M5BH.svd">
			  <datapatch  __dp="0" __ap="0" address="0xE0040FCC" value="0x11" info="DEVTYPE"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FF0" value="0x0D" info="CIDR0"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FF4" value="0x90" info="CIDR1"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FF8" value="0x05" info="CIDR2"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FFC" value="0xB1" info="CIDR3"/>       
              <datapatch  __dp="0" __ap="0" address="0xE0040FD0" value="0x04" info="PIDR4"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FD4" value="0x00" info="PIDR5"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FD8" value="0x00" info="PIDR6"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FDC" value="0x00" info="PIDR7"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FE0" value="0x21" info="PIDR0"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FE4" value="0xBD" info="PIDR1"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FE8" value="0x0B" info="PIDR2"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FEC" value="0x00" info="PIDR3 (ECOREVNUM)"/>
            </debug>

			<debugvars configfile="Debug/RA6M5.dbgconf">
              __var TRCK_value      = 0x00000001;   // Trace Clock operating frequency /1
            </debugvars>

