XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Renesas.RA_DFP.pdsc
            <sequences>
              <sequence name="EnableTraceClock">
                <block>
                  Write16( 0x4001E3FE, 0xA501 ) ;  // set PRCR, bit PRC0
                  Write8( 0x4001E03F, 0x80 | TRCK_value ) ;  // set TRCKCR, bit TRCKEN and TRCK[]
                  Write16( 0x4001E3FE, 0xA500 ) ;  // clear PRCR, bit PRC0
                </block>
              </sequence>

              <sequence name="DebugDeviceUnlock">
                <block>
                  __var trace_enabled = ( __traceout &amp; 0x3 ) != 0 ; // TPIU or SWO Trace Selected?
                </block>

                <control if="trace_enabled">
                  <block>
                    Sequence("EnableTraceClock");
                  </block>
                </control>
              </sequence>

              <sequence name="ConfigureTraceTPIUPins">
                <block>
                  __var parallel_trace_port_size = ( __traceout &amp; 0x003F0000 ) &gt;&gt; 16 ;
                  Write8( 0x40080D03, 0x00 ) ;  // clear PWPR, bit B0WI
                  Write8( 0x40080D03, 0x40 ) ;  // set PWPR, bit PFSWE
                  Write32( 0x400808B8, 0x1A010C00 ) ;  // P214: TCLK
                </block>

                <control if="parallel_trace_port_size &gt;= 1" info="TPIU port width 1">
                  <block info="configure Trace I/O Enable + Trace Mode Synchronous 1 bit">
                    Write32( 0x400808AC, 0x1A010C00 ) ;  // P211: TDATA0
                  </block>
                </control>
                <control if="parallel_trace_port_size &gt;= 2" info="TPIU port width 2">
                  <block info="configure Trace I/O Enable + Trace Mode Synchronous 2 bit">
                    Write32( 0x400808A8, 0x1A010C00 ) ;  // P210: TDATA1
                  </block>
                </control>
                <control if="parallel_trace_port_size &gt;= 4" info="TPIU port width 4">
                  <block info="configure Trace I/O Enable + Trace Mode Synchronous 4 bit">
                    Write32( 0x400808A4, 0x1A010C00 ) ;  // P209: TDATA2
                    Write32( 0x400808A0, 0x1A010C00 ) ;  // P208: TDATA3
                  </block>
                </control>
                <block>
                  Write8( 0x40080D03, 0x00);  // clear PWPR, bit PFSWE
                  Write8( 0x40080D03, 0x80);  // set PWPR, bit B0WI
                </block>
              </sequence>

              <sequence name="TraceStart ">
                <block>
                  __var tpiu_trace_enabled = ( __traceout &amp; 0x2 ) != 0 ; // TPIU Trace Selected?
                  Sequence( "EnableTraceClock" ) ;
                </block>
                <control if="tpiu_trace_enabled">
                  <block>
                    Sequence( "ConfigureTraceTPIUPins" ) ;
                  </block>
                </control>
              </sequence>
            </sequences>

			<subFamily DsubFamily="RA6M5_2M">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x200000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x08000000" size="0x002000"/>
				<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x300"/>
				<memory name="SRAM1"    access="rwx" start="0x20000000" size="0x040000" init   ="0" default="1"/>
				<algorithm name="Flash/RA6M5_2M.FLM"            start="0x00000000" size="0x200000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6M5_DATA_C2M.FLM"      start="0x08000000" size="0x002000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6M5_CONF.FLM"          start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA6M5AH"/>
				<device Dname="R7FA6M5BH"/>

			</subFamily>

			<subFamily DsubFamily="RA6M5_1.5M">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x180000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x08000000" size="0x002000"/>
				<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x300"/>
				<memory name="SRAM1"    access="rwx" start="0x20000000" size="0x040000" init   ="0" default="1"/>
				<algorithm name="Flash/RA6M5_1_dot_5M.FLM"      start="0x00000000" size="0x180000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6M5_DATA_C1dot5M.FLM"  start="0x08000000" size="0x002000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6M5_CONF.FLM"          start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA6M5AG"/>	
				<device Dname="R7FA6M5BG"/>
			</subFamily>

			<subFamily DsubFamily="RA6M5_1M">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x100000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x08000000" size="0x002000"/>
				<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x300"/>
				<memory name="SRAM1"    access="rwx" start="0x20000000" size="0x040000" init   ="0" default="1"/>
				<algorithm name="Flash/RA6M5_1M.FLM"            start="0x00000000" size="0x100000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6M5_DATA_C1M.FLM"      start="0x08000000" size="0x002000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6M5_CONF.FLM"          start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA6M5BF"/>
			</subFamily>
		</family>

		<!-- RA6T1 Part number definitions -->

		<family Dfamily="RA6T1 Series" Dvendor="Renesas:117">
			<processor Dcore="Cortex-M4" DcoreVersion="r0p1" Dfpu="SP_FPU" Dmpu="MPU" Ddsp="DSP" Dendian="Little-endian" Dclock="120000000" />
			<description>
The MCU integrates multiple series of software- and pin-compatible Arm®-based 32-bit cores that share a common set
of Renesas peripherals to facilitate design scalability and efficient platform-based product development.
The MCU in this series incorporates a high-performance Arm Cortex®-M4 core running up to 120 MHz with the
following features:
- Up to 512-KB code flash memory
- 64-KB SRAM
- Security and safety features
- 12-bit A/D Converter (ADC12)
- 12-bit D/A Converter (DAC12)
- Analog peripherals.

			</description>
			<feature type="Timer" 				n="13"	m="32"			name="General PWM Timer (GPT)"/>			
			<feature type="Timer"      			n="2"	m="16"			name="Asynchronous General Purpose Timer (AGT)"/>
			<feature type="WDT"					n="1"	m="14"			name="Watchdog Timer (WDT)"/>
			<feature type="ComOther"			n="7"					name="Serial Communications Interface (SCI)"/>	
			<feature type="I2C"					n="2"					name="I2C bus interface (IIC)"/>	
			<feature type="SPI"					n="2"					name="Serial Peripheral Interface (SPI)"/>	
			<feature type="CAN"					n="1"					name="Controller Area Network (CAN)"/>				
			<feature type="ADC"					n="8"	m="14"			name="14-bit A/D Converter (ADC14)"/>				
			<feature type="DAC"					n="2"	m="8"			name="8-bit D/A Converter (DAC8)"/>
			<feature type="TempSens"			n="1"					name="Temperature Sensor (TSN)"/>	
			<feature type="CoreOther"			n="2"					name="Low-Power Analog Comparator(ACMPHS)"/>
			<feature type="Touch"				n="27"					name="Capacitive Touch Sensing Unit(CTSU)"/>
			<feature type="CoreOther"			n="1"					name="Cyclic Redundancy Check (CRC) calculator"/>			
			<feature type="CoreOther"			n="1"					name="Data Operation Circuit (DOC)"/>
			<feature type="Crypto"				n="128"					name="AES128 Engine"/>	
			<feature type="Crypto"				n="256"					name="AES256 Engine"/>	
			<feature type="Crypto"				n="192"					name="AES192 Engine"/>	
			<feature type="RNG"											name="True Random Number Generator(TRNG)"/>			
			<feature type="Memory"				n="512"					name="Code Flash KB"/>
			<feature type="Memory"				n="64"					name="SRAM KB"/>
			<feature type="Memory"				n="8"					name="Data Flash KB"/>			
			<feature type="PLL"         		n="1"                   name="Internal PLL"/>
			<feature type="VCC"         		n="1.6"   m="5.5"       name="Power Supply Voltage"/>
			<feature type="Temp"        		n="-40"   m="105"       name="Operating Temperature Range"/>
			<feature type="QFP"        			n="100"            		name="Quad-Flat Pack 100"/>
			<feature type="QFP"        			n="64"            		name="Quad-Flat Pack 64"/>
			<feature type="XTAL"        		m="100000000"            name="Maximum operating frequency"/>
			<feature type="PLL"        		            				name="5 internal PLLs"/>
			<feature type="DMA"        		    n="8"        			name="DMAC"/>	
			<debug	svd="SVD/R7FA6T1AD.svd"/>
			
			<subFamily DsubFamily="RA6T1_512K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x080000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x40100000" size="0x002000"/>
				<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x80"/>
				<memory name="SRAM1"    access="rwx" start="0x1FFE0000" size="0x010000" init   ="0" default="1"/>
				<algorithm name="Flash/RA6T1_512K.FLM"          start="0x00000000" size="0x080000" RAMstart="0x1FFE0000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6T1_DATA_C512K.FLM"    start="0x40100000" size="0x002000" RAMstart="0x1FFE0000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6T1_CONF.FLM"          start="0x0100A000" size="0x000080" RAMstart="0x1FFE0000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA6T1AD"/>
			</subFamily>


			<subFamily DsubFamily="RA6T1_256K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x040000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x40100000" size="0x002000"/>
				<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x80"/>
				<memory name="SRAM1"    access="rwx" start="0x1FFE0000" size="0x010000" init   ="0" default="1"/>
				<algorithm name="Flash/RA6T1_256K.FLM"          start="0x00000000" size="0x040000" RAMstart="0x1FFE0000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6T1_DATA_C256K.FLM"    start="0x40100000" size="0x002000" RAMstart="0x1FFE0000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6T1_CONF.FLM"          start="0x0100A000" size="0x000080" RAMstart="0x1FFE0000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA6T1AB"/>
			</subFamily>			
		  </family>		

		<!-- RA6T2 Part number definitions -->

		<family Dfamily="RA6T2 Series" Dvendor="Renesas:117">

			<processor Dcore="Cortex-M33" DcoreVersion="r0p4-00rel0" Dtz="TZ" Dfpu="SP_FPU" Dmpu="MPU" Ddsp="DSP" Dendian="Little-endian" Dclock="240000000" />
			<description>
The MCU integrates multiple series of software-compatible Arm®-based 32-bit cores that share a common set of Renesas
peripherals to facilitate design scalability and efficient platform-based product development.
The MCU in this series incorporates a high-performance Arm Cortex®-M33 core running up to 200 MHz with the following
features:
- Up to 512 KB code flash memory
- 64 KB SRAM
- General PWM Timer (GPT) - Enhanced High Resolution
- Analog peripherals
- Security and safety features

			</description> 
			<feature type="Timer" 				n="4"	m="32"			name="General PWM Timer (GPT32)"/>			
			<feature type="Timer" 				n="6"	m="16"			name="General PWM Timer (GPT16)"/>
			<feature type="Timer"      			n="6"	m="16"			name="Asynchronous General Purpose Timer (AGT)"/>
			<feature type="RTC"     						   			name="Real Time CLock"/>
			<feature type="WDT"					n="1"	m="14"			name="Watchdog Timer (WDT)"/>
			<feature type="WDT"					n="1"	m="14"			name="Independent Watchdog Timer (IWDT)"/>	
			<feature type="CAN" 				n="2" 					name="CAN FD Controller"/>
			<feature type="ComOther"			n="10"					name="Serial Communications Interface (SCI)"/>
			<feature type="ComOther"			n="1"					name="Quad Serial Peripheral Interface (QSPI)"/>	
			<feature type="ComOther"			n="1"					name="Octa Serial Peripheral Interface (OSPI)"/>
			<feature type="ComOther"			n="1"					name="Serial Communications Interface (IrDA)"/>	
			<feature type="ComOther"			n="1"					name="Serial Sound Interface Enhanced (SSIE)"/>
			<feature type="ComOther"			n="1"					name="SD/MMC Host Interface (SDHI)"/>			
			<feature type="I2C"					n="2"					name="I2C bus interface (IIC)"/>	
			<feature type="SPI"					n="2"					name="Serial Peripheral Interface (SPI)"/>	
			<feature type="CAN"					n="2"					name="Controller Area Network (CAN)"/>		
			<feature type="ADC"					n="22"	m="12"			name="12-bit A/D Converter (ADC12)"/>	
			<feature type="DAC"					n="2"	m="12"			name="12-bit D/A Converter (DAC12)"/>			
			<feature type="TempSens"			n="1"					name="Temperature Sensor (TSN)"/>	
			<feature type="Touch"				n="20"					name="Capacitive Touch Sensing Unit(CTSU)"/>		
			<feature type="Crypto"				n="128"					name="AES128 Engine"/>	
			<feature type="Crypto"				n="192"					name="AES192 Engine"/>	
			<feature type="Crypto"				n="256"					name="AES256 Engine"/>	
			<feature type="Crypto"				n="1024"				name="RSA1024 Engine"/>
			<feature type="Crypto"				n="2048"				name="RSA2048 Engine"/>
			<feature type="Crypto"				n="3072"				name="RSA3072 Engine"/>
			<feature type="Crypto"				n="4096"				name="RSA4096 Engine"/>	
			<feature type="Crypto"				n="1024.160"			name="DSA160 Engine"/>
			<feature type="Crypto"				n="2048.224"			name="DSA224 Engine"/>
			<feature type="Crypto"				n="2048.256"			name="DSA256 Engine"/>	
			<feature type="Crypto"				n="192"					name="ECC NIST P192"/>				
			<feature type="Crypto"				n="224"					name="ECC NIST P224"/>	
			<feature type="Crypto"				n="256"					name="ECC NIST P256"/>	
			<feature type="Crypto"				n="384"					name="ECC NIST P384"/>	
			<feature type="Crypto"				n="256"					name="ECC Branpool 256"/>
			<feature type="Crypto"				n="384"					name="ECC Branpool384"/>			
			<feature type="Crypto"				n="512"					name="ECC Branpool 512"/>	
			<feature type="Crypto"				n="384"					name="SHA 384"/>			
			<feature type="Crypto"				n="224"					name="SHA 224"/>	
			<feature type="RNG"											name="True Random Number Generator(TRNG)"/>				
			<feature type="PLL"         		n="2"                   name="Internal PLL"/>
			<feature type="VCC"         		n="2.7"   m="3.6"       name="Power Supply Voltage"/>
			<feature type="Temp"        		n="-40"   m="105"       name="Operating Temperature Range"/>			
			<feature type="QFP"        			n="144"           		name="LQFP (20 mm × 20 mm, 0.5 mm pitch)"/>
			<feature type="QFP"        			n="100"           		name="LQFP (14 mm × 14 mm, 0.5 mm pitch)"/>
			<feature type="QFP"        			n="64"           		name="LQFP (10 mm × 10 mm, 0.5 mm pitch)"/>			
			<feature type="XTAL"        		m="200000000"           name="Maximum operating frequency"/>
			<feature type="ClockOther"        		            		name="5 independant clock sources"/>
			<feature type="DMA"        		    n="8"        			name="DMAC"/>
			<feature type="USBD"       		    n="1"        			name="USB 2.0 Full-Speed Module (USBFS)"/>
			<feature type="USBH"       		    n="1"        			name="USB 2.0 Full-Speed Module (USBFS)"/>
			<feature type="ETH"       		    n="1"        			name="Ethernet MAC/DMA Controller (ETHERC/EDMAC)"/>			            				
			<debug	svd="SVD/R7FA6T2BD.svd">
			  <datapatch  __dp="0" __ap="0" address="0xE0040FCC" value="0x11" info="DEVTYPE"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FF0" value="0x0D" info="CIDR0"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FF4" value="0x90" info="CIDR1"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FF8" value="0x05" info="CIDR2"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FFC" value="0xB1" info="CIDR3"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FD0" value="0x04" info="PIDR4"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FD4" value="0x00" info="PIDR5"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FD8" value="0x00" info="PIDR6"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FDC" value="0x00" info="PIDR7"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FE0" value="0x21" info="PIDR0"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FE4" value="0xBD" info="PIDR1"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FE8" value="0x0B" info="PIDR2"/>
              <datapatch  __dp="0" __ap="0" address="0xE0040FEC" value="0x00" info="PIDR3 (ECOREVNUM)"/>
            </debug>

