XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Renesas.RA_DFP.pdsc
			<debugvars configfile="Debug/RA6T2.dbgconf">
              __var TRCK_value      = 0x00000001;   // Trace Clock operating frequency /2
            </debugvars>

            <sequences>
              <sequence name="EnableTraceClock">
                <block>
                  Write16( 0x4001E3FE, 0xA501 ) ;  // set PRCR, bit PRC0
                  Write8( 0x4001E03F, 0x80 | TRCK_value ) ;  // set TRCKCR, bit TRCKEN and TRCK[]
                  Write16( 0x4001E3FE, 0xA500 ) ;  // clear PRCR, bit PRC0
                </block>
              </sequence>

              <sequence name="DebugDeviceUnlock">
                <block>
                  __var trace_enabled = ( __traceout &amp; 0x3 ) != 0 ; // TPIU or SWO Trace Selected?
                </block>

                <control if="trace_enabled">
                  <block>
                    Sequence("EnableTraceClock");
                  </block>
                </control>
              </sequence>

              <sequence name="ConfigureTraceTPIUPins">
                <block>
                  __var parallel_trace_port_size = ( __traceout &amp; 0x003F0000 ) &gt;&gt; 16 ;
                  Write8( 0x4001FD0C, 0x00 ) ;  // clear PWPR, bit B0WI
                  Write8( 0x4001FD0C, 0x40 ) ;  // set PWPR, bit PFSWE
                  Write32( 0x4001FB88, 0x1A010C00 ) ;  // PE02: TRCLK
                </block>

                <control if="parallel_trace_port_size &gt;= 1" info="TPIU port width 1">
                  <block info="configure Trace I/O Enable + Trace Mode Synchronous 1 bit">
                    Write32( 0x4001FB8C, 0x1A010C00 ) ;  // PE03: TDATA0
                  </block>
                </control>
                <control if="parallel_trace_port_size &gt;= 2" info="TPIU port width 2">
                  <block info="configure Trace I/O Enable + Trace Mode Synchronous 2 bit">
                    Write32( 0x4001FB90, 0x1A010C00 ) ;  // PE04: TDATA1
                  </block>
                </control>
                <control if="parallel_trace_port_size &gt;= 4" info="TPIU port width 4">
                  <block info="configure Trace I/O Enable + Trace Mode Synchronous 4 bit">
                    Write32( 0x4001FB94, 0x1A010C00 ) ;  // PE05: TDATA2
                    Write32( 0x4001FB98, 0x1A010C00 ) ;  // PE06: TDATA3
                  </block>
                </control>
                <block>
                  Write8( 0x4001FD0C, 0x00);  // clear PWPR, bit PFSWE
                  Write8( 0x4001FD0C, 0x80);  // set PWPR, bit B0WI
                </block>
              </sequence>

              <sequence name="TraceStart ">
                <block>
                  __var tpiu_trace_enabled = ( __traceout &amp; 0x2 ) != 0 ; // TPIU Trace Selected?
                  Sequence( "EnableTraceClock" ) ;
                </block>
                <control if="tpiu_trace_enabled">
                  <block>
                    Sequence( "ConfigureTraceTPIUPins" ) ;
                  </block>
                </control>
              </sequence>
            </sequences>

			<subFamily DsubFamily="RA6T2_512K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x080000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x08000000" size="0x004000"/>
				<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x000300"/>
				<memory name="SRAM1"    access="rwx" start="0x20000000" size="0x010000" init   ="0" default="1"/>
				<algorithm name="Flash/RA6T2_512K.FLM"          start="0x00000000" size="0x080000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6T2_DATA_C512K.FLM"    start="0x08000000" size="0x004000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6T2_CONF.FLM"          start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA6T2AD"/>	
				<device Dname="R7FA6T2BD"/>
			</subFamily>

			<subFamily DsubFamily="RA6T2_256K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x040000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x08000000" size="0x004000"/>
				<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x000300"/>
				<memory name="SRAM1"    access="rwx" start="0x20000000" size="0x010000" init   ="0" default="1"/>
				<algorithm name="Flash/RA6T2_256K.FLM"          start="0x00000000" size="0x040000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6T2_DATA_C256K.FLM"    start="0x08000000" size="0x004000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6T2_CONF.FLM"          start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA6T2AB"/>
				<device Dname="R7FA6T2BB"/>
			</subFamily>
			
		</family>

		<!-- RA6E1 Part number definitions -->

		<family Dfamily="RA6E1 Series" Dvendor="Renesas:117">

			<processor Dcore="Cortex-M33" DcoreVersion="r0p4-00rel0" Dtz="TZ" Dfpu="SP_FPU" Dmpu="MPU" Ddsp="DSP" Dendian="Little-endian" Dclock="200000000" />
			<description>
The MCU integrates multiple series of software-compatible Arm®-based 32-bit cores that share a common set of Renesas
peripherals to facilitate design scalability and efficient platform-based product development.
The MCU in this series incorporates a high-performance Arm Cortex®-M33 core running up to 200 MHz with the following
features:
- Up to 1 MB code flash memory
- 256 KB SRAM
- Quad Serial Peripheral Interface (QSPI)
- Ethernet MAC Controller (ETHERC), USBFS, SD/MMC Host Interface
- Analog peripherals
- Security and safety features

			</description> 
			<feature type="Timer" 				n="4"	m="32"			name="General PWM Timer (GPT32)"/>			
			<feature type="Timer" 				n="6"	m="16"			name="General PWM Timer (GPT16)"/>
			<feature type="Timer"      			n="6"	m="16"			name="Asynchronous General Purpose Timer (AGT)"/>
			<feature type="RTC"     						   			name="Real Time CLock"/>
			<feature type="WDT"					n="1"	m="14"			name="Watchdog Timer (WDT)"/>
			<feature type="WDT"					n="1"	m="14"			name="Independent Watchdog Timer (IWDT)"/>	
			<feature type="CAN" 				n="2" 					name="CAN FD Controller"/>
			<feature type="ComOther"			n="10"					name="Serial Communications Interface (SCI)"/>
			<feature type="ComOther"			n="1"					name="Quad Serial Peripheral Interface (QSPI)"/>	
			<feature type="ComOther"			n="1"					name="Octa Serial Peripheral Interface (OSPI)"/>
			<feature type="ComOther"			n="1"					name="Serial Communications Interface (IrDA)"/>	
			<feature type="ComOther"			n="1"					name="Serial Sound Interface Enhanced (SSIE)"/>
			<feature type="ComOther"			n="1"					name="SD/MMC Host Interface (SDHI)"/>			
			<feature type="I2C"					n="2"					name="I2C bus interface (IIC)"/>	
			<feature type="SPI"					n="2"					name="Serial Peripheral Interface (SPI)"/>	
			<feature type="CAN"					n="2"					name="Controller Area Network (CAN)"/>		
			<feature type="ADC"					n="22"	m="12"			name="12-bit A/D Converter (ADC12)"/>	
			<feature type="DAC"					n="2"	m="12"			name="12-bit D/A Converter (DAC12)"/>			
			<feature type="TempSens"			n="1"					name="Temperature Sensor (TSN)"/>	
			<feature type="Touch"				n="20"					name="Capacitive Touch Sensing Unit(CTSU)"/>		
			<feature type="Crypto"				n="128"					name="AES128 Engine"/>	
			<feature type="Crypto"				n="192"					name="AES192 Engine"/>	
			<feature type="Crypto"				n="256"					name="AES256 Engine"/>	
			<feature type="Crypto"				n="1024"				name="RSA1024 Engine"/>
			<feature type="Crypto"				n="2048"				name="RSA2048 Engine"/>
			<feature type="Crypto"				n="3072"				name="RSA3072 Engine"/>
			<feature type="Crypto"				n="4096"				name="RSA4096 Engine"/>	
			<feature type="Crypto"				n="1024.160"			name="DSA160 Engine"/>
			<feature type="Crypto"				n="2048.224"			name="DSA224 Engine"/>
			<feature type="Crypto"				n="2048.256"			name="DSA256 Engine"/>	
			<feature type="Crypto"				n="192"					name="ECC NIST P192"/>				
			<feature type="Crypto"				n="224"					name="ECC NIST P224"/>	
			<feature type="Crypto"				n="256"					name="ECC NIST P256"/>	
			<feature type="Crypto"				n="384"					name="ECC NIST P384"/>	
			<feature type="Crypto"				n="256"					name="ECC Branpool 256"/>
			<feature type="Crypto"				n="384"					name="ECC Branpool384"/>			
			<feature type="Crypto"				n="512"					name="ECC Branpool 512"/>	
			<feature type="Crypto"				n="384"					name="SHA 384"/>			
			<feature type="Crypto"				n="224"					name="SHA 224"/>	
			<feature type="RNG"											name="True Random Number Generator(TRNG)"/>				
			<feature type="PLL"         		n="2"                   name="Internal PLL"/>
			<feature type="VCC"         		n="2.7"   m="3.6"       name="Power Supply Voltage"/>
			<feature type="Temp"        		n="-40"   m="105"       name="Operating Temperature Range"/>			
			<feature type="QFP"        			n="144"           		name="LQFP (20 mm × 20 mm, 0.5 mm pitch)"/>
			<feature type="QFP"        			n="100"           		name="LQFP (14 mm × 14 mm, 0.5 mm pitch)"/>
			<feature type="QFP"        			n="64"           		name="LQFP (10 mm × 10 mm, 0.5 mm pitch)"/>			
			<feature type="XTAL"        		m="200000000"           name="Maximum operating frequency"/>
			<feature type="ClockOther"        		            		name="5 independant clock sources"/>
			<feature type="DMA"        		    n="8"        			name="DMAC"/>
			<feature type="USBD"       		    n="1"        			name="USB 2.0 Full-Speed Module (USBFS)"/>
			<feature type="USBH"       		    n="1"        			name="USB 2.0 Full-Speed Module (USBFS)"/>
			<feature type="ETH"       		    n="1"        			name="Ethernet MAC/DMA Controller (ETHERC/EDMAC)"/>			            				
			<debug	svd="SVD/R7FA6E10F.svd"/>

			<subFamily DsubFamily="RA6E1_1M">
				<device Dname="R7FA6E10F">	
					<memory name="Flash"     access="rx" start="0x00000000" size="0x100000" startup="1" default="1"/>
					<memory name="DataFlash" access="r"  start="0x08000000" size="0x002000"/>
					<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x000300"/>
					<memory name="SRAM1"    access="rwx" start="0x20000000" size="0x040000" init   ="0" default="1"/>
					<algorithm name="Flash/RA6E1_1M.FLM"          	start="0x00000000" size="0x100000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
					<algorithm name="Flash/RA6E1_DATA_C1M.FLM"    	start="0x08000000" size="0x002000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
					<algorithm name="Flash/RA6E1_CONF.FLM"          start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				</device>
				
				<device Dname="R7FA6E10F_dual">
					<memory name="Flash_Lower"           access="rx"        start="0"          size="0x080000" startup="1" default="1"/>
					<memory name="Flash_Upper"           access="rx"        start="0x00200000" size="0x080000"/>
					<memory name="DataFlash" access="r"  start="0x08000000" size="0x002000"/>
					<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x300"/>
					<memory name="SRAM1"    access="rwx" start="0x20000000" size="0x010000" init   ="0" default="1"/>
					<algorithm name="Flash/RA6E1_1M_dual_lower.FLM" start="0x00000000" size="0x080000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
					<algorithm name="Flash/RA6E1_1M_dual_upper.FLM" start="0x00200000" size="0x080000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
					<algorithm name="Flash/RA6E1_DATA_C1M_D.FLM"    start="0x08000000" size="0x002000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
					<algorithm name="Flash/RA6E1_CONF.FLM"          start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				</device>
					
			</subFamily>

			<subFamily DsubFamily="RA6E1_512K">
				<device Dname="R7FA6E10D">					
					<memory name="Flash"     access="rx" start="0x00000000" size="0x080000" startup="1" default="1"/>
					<memory name="DataFlash" access="r"  start="0x08000000" size="0x002000"/>
					<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x000300"/>
					<memory name="SRAM1"    access="rwx" start="0x20000000" size="0x010000" init   ="0" default="1"/>
					<algorithm name="Flash/RA6E1_512K.FLM"          start="0x00000000" size="0x080000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
					<algorithm name="Flash/RA6E1_DATA_C512K.FLM"    start="0x08000000" size="0x002000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
					<algorithm name="Flash/RA6E1_CONF.FLM"          start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>		
				</device>	
				
