XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Renesas.RA_DFP.pdsc
				<device Dname="R7FA6E10D_dual">
					<memory name="Flash_Lower"           access="rx"        start="0"          size="0x040000" startup="1" default="1"/>
					<memory name="Flash_Upper"           access="rx"        start="0x00200000" size="0x040000"/>
					<memory name="DataFlash" access="r"  start="0x08000000" size="0x002000"/>
					<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x300"/>
					<memory name="SRAM1"    access="rwx" start="0x20000000" size="0x010000" init   ="0" default="1"/>
					<algorithm name="Flash/RA6E1_512K_dual_lower.FLM" start="0x00000000" size="0x040000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
					<algorithm name="Flash/RA6E1_512K_dual_upper.FLM" start="0x00200000" size="0x040000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
					<algorithm name="Flash/RA6E1_DATA_C512K_D.FLM"  start="0x08000000" size="0x002000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
					<algorithm name="Flash/RA6E1_CONF.FLM"          start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				</device>
				
			</subFamily>
		</family>

	    <!-- RA4E2 Part number definitions -->

		<family Dfamily="RA4E2 Series" Dvendor="Renesas:117">
			<processor Dcore="Cortex-M33" DcoreVersion="r0p4-00rel1" Dtz="TZ" Dfpu="SP_FPU" Dmpu="MPU" Ddsp="DSP" Dendian="Little-endian" Dclock="100000000" />
			<description>
The RA4E2 Group delivers up to 100 MHz of CPU performance 
using an Arm Cortex-M33 core with 128KB of code flash memory,
4 KB of data flash memory, and 40 KB of SRAM. A wide set of 
peripherals is provided, including CANFD, I3C, and ADC.
			</description>
			
			<debug	svd="SVD/R7FA4E2B9.svd"/>

			<subFamily DsubFamily="RA4E2_128K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x20000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x08000000" size="0x1000"/>
				<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x300"/>
				<memory name="SRAM1"    access="rwx" start="0x20000000" size="0xA000" init   ="0" default="1"/>
				<algorithm name="Flash/RA4E2_128K.FLM"      start="0x00000000" size="0x20000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA4E2_DATA.FLM"      start="0x08000000" size="0x001000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA4E2_CONF.FLM"      start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA4E2B9"/>		
			</subFamily>	

			</family>

	    <!-- RA6E2 Part number definitions -->

		<family Dfamily="RA6E2 Series" Dvendor="Renesas:117">
			<processor Dcore="Cortex-M33" DcoreVersion="r0p4-00rel1" Dtz="TZ" Dfpu="SP_FPU" Dmpu="MPU" Ddsp="DSP" Dendian="Little-endian" Dclock="200000000" />
			<description>
The RA6E2 Group delivers up to 200 MHz of CPU performance
using an Arm Cortex-M33 core with code flash memory ranging
from 128 KB to 256 KB, 4 KB of data flash memory, and 40 KB
of SRAM. A wide set of peripherals is provided, including 
QSPI, CANFD, I3C, and ADC.
			</description>			
			<debug	svd="SVD/R7FA6E2BB.svd"/>

			<subFamily DsubFamily="RA6E2_256K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x40000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x08000000" size="0x1000"/>
				<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x300"/>
				<memory name="SRAM1"    access="rwx" start="0x20000000" size="0xA000" init   ="0" default="1"/>
				<algorithm name="Flash/RA6E2_256K.FLM"          start="0x00000000" size="0x40000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6E2_DATA_C256K.FLM"    start="0x08000000" size="0x001000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6E2_CONF.FLM"          start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA6E2BB"/>
			</subFamily>			

			<subFamily DsubFamily="RA6E2_128K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x20000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x08000000" size="0x1000"/>
				<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x300"/>
				<memory name="SRAM1"    access="rwx" start="0x20000000" size="0xA000" init   ="0" default="1"/>
				<algorithm name="Flash/RA6E2_128K.FLM"          start="0x00000000" size="0x20000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6E2_DATA_C128K.FLM"    start="0x08000000" size="0x001000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6E2_CONF.FLM"          start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA6E2B9"/>			
			</subFamily>	

			</family>

	    <!-- RA4T1 Part number definitions -->

		<family Dfamily="RA4T1 Series" Dvendor="Renesas:117">
			<processor Dcore="Cortex-M33" DcoreVersion="r0p4-00rel1" Dtz="TZ" Dfpu="SP_FPU" Dmpu="MPU" Ddsp="DSP" Dendian="Little-endian" Dclock="100000000" />
			<description>
The RA4T1 Group delivers up to 100 MHz of CPU performance using an
Arm Cortex-M33 core with a code flash memory ranging from 128 KB 
to 256 KB, 4 KB of data flash memory, and 40 KB of SRAM. The RA4T1
Group offers a wide set of peripherals, including CANFD, I3C, and
ADC.
			</description>
			<debug	svd="SVD/R7FA4T1BB.svd"/>

			<subFamily DsubFamily="RA4T1_256K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x40000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x08000000" size="0x001000"/>
				<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x300"/>
				<memory name="SRAM1"    access="rwx" start="0x20000000" size="0xA000" init   ="0" default="1"/>

				<algorithm name="Flash/RA4T1_256K.FLM"          start="0x00000000" size="0x40000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA4T1_DATA_C256K.FLM"    start="0x08000000" size="0x001000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA4T1_CONF.FLM"          start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				
				<device Dname="R7FA4T1BB"/>		
			</subFamily>			

			<subFamily DsubFamily="RA4T1_128K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x20000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x08000000" size="0x001000"/>
				<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x300"/>
				<memory name="SRAM1"    access="rwx" start="0x20000000" size="0xA000" init   ="0" default="1"/>

				<algorithm name="Flash/RA4T1_128K.FLM"        start="0x00000000" size="0x20000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA4T1_DATA_C128K.FLM"  start="0x08000000" size="0x001000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA4T1_CONF.FLM"        start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>

				<device Dname="R7FA4T1B9"/>			
			</subFamily>	
		</family>

	    <!-- RA6T3 Part number definitions -->

		<family Dfamily="RA6T3 Series" Dvendor="Renesas:117">
			<processor Dcore="Cortex-M33" DcoreVersion="r0p4-00rel1" Dtz="TZ" Dfpu="SP_FPU" Dmpu="MPU" Ddsp="DSP" Dendian="Little-endian" Dclock="200000000" />
			<description>
The RA6T3 Group delivers up to 200 MHz of CPU performance using an
Arm Cortex-M33 core with 256KB of code flash memory, 4 KB of data
flash memory, and 40 KB of SRAM. The RA6T3 Group offers a wide set
of peripherals, including CANFD, I3C, and ADC.
			</description>
			
			<debug	svd="SVD/R7FA6T3BB.svd"/>

			<subFamily DsubFamily="RA6T3_256K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x40000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x08000000" size="0x001000"/>
				<memory name="ConfigROM" access="r"  start="0x0100A000" size="0x300"/>
				<memory name="SRAM1"    access="rwx" start="0x20000000" size="0xA000" init   ="0" default="1"/>

				<algorithm name="Flash/RA6T3_256K.FLM" start="0x00000000" size="0x40000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6T3_DATA.FLM" start="0x08000000" size="0x001000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA6T3_CONF.FLM" start="0x0100A000" size="0x000300" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>

