XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Renesas.RA_DFP.pdsc
				<device Dname="R7FA6T3BB"/>
			
			</subFamily>			

		</family>

	    <!-- RA8M1 Part number definitions -->

		<family Dfamily="RA8M1 Series" Dvendor="Renesas:117">
			<processor Dcore="Cortex-M85" DcoreVersion="r0p0" Dtz="TZ" Dfpu="DP_FPU" Dmpu="MPU" Ddsp="DSP" Dmve="FP_MVE" Dpacbti="PACBTI" Dendian="Little-endian" Dclock="480000000" />
			<description>
The RA8M1 Group incorporates a high-performance Arm Cortex-M85 
core with Helium running up to 480 MHz and feature up to 2 MB
code flash memory, 1 MB SRAM (128 KB of TCM RAM, 896 KB of 
user SRAM), Octal Serial Peripheral Interface (OSPI), Ethernet
MAC Controller (ETHERC), USBFS, USBHS, SD/MMC Host Interface,
Analog peripherals, plus Security and safety features.
			</description>			
			<debug	svd="SVD/R7FA8M1AH.svd"/>

			<subFamily DsubFamily="RA8M1_1M">
				<memory name="Flash"     access="rx" start="0x02000000" size="0x00100000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x27000000" size="0x3000"/>
				<memory name="ConfigROM" access="r"  start="0x0300A100" size="0x100"/>
				<memory name="ConfigROM_S" access="r"  start="0x0300A200" size="0x100"/>
				<memory name="SRAM"    access="rwx" start="0x22000000" size="0xE0000" init   ="0" default="1"/>
				<memory name="ITCM"    access="rwx" start="0x0" size="0x10000"/>
				<memory name="DTCM"    access="rw" start="0x20000000" size="0x10000"/>

				<algorithm name="Flash/RA8M1_1M.FLM"        start="0x02000000" size="0x00100000" RAMstart="0x22000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA8M1_DATA_C1M.FLM"  start="0x27000000" size="0x3000" RAMstart="0x22000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA8M1_CCONF.FLM"     start="0x0300A100" size="0x000200" RAMstart="0x22000000" RAMsize="0x2000" default="1"/>
		
				<device Dname="R7FA8M1AF"/>
			</subFamily>			

			<subFamily DsubFamily="RA8M1_2M">
				<memory name="Flash"     access="rx" start="0x02000000" size="0x001F8000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x27000000" size="0x3000"/>
				<memory name="ConfigROM" access="r"  start="0x0300A100" size="0x100"/>
				<memory name="ConfigROM_S" access="r"  start="0x0300A200" size="0x100"/>
				<memory name="SRAM"    access="rwx" start="0x22000000" size="0xE0000" init   ="0" default="1"/>
				<memory name="ITCM"    access="rwx" start="0x0" size="0x10000"/>
				<memory name="DTCM"    access="rw" start="0x20000000" size="0x10000"/>

				<algorithm name="Flash/RA8M1_2M.FLM"        start="0x02000000" size="0x001F8000" RAMstart="0x22000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA8M1_DATA_C2M.FLM"  start="0x27000000" size="0x3000" RAMstart="0x22000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA8M1_CCONF.FLM"     start="0x0300A100" size="0x000200" RAMstart="0x22000000" RAMsize="0x2000" default="1"/>

				<device Dname="R7FA8M1AH"/>		
			</subFamily>	
		</family>

	    <!-- RA8D1 Part number definitions -->

		<family Dfamily="RA8D1 Series" Dvendor="Renesas:117">
			<processor Dcore="Cortex-M85" DcoreVersion="r0p0" Dtz="TZ" Dfpu="DP_FPU" Dmpu="MPU" Ddsp="DSP" Dmve="FP_MVE" Dpacbti="PACBTI" Dendian="Little-endian" Dclock="480000000" />
			<description>
The RA8D1 Group incorporates a high-performance Arm Cortex-M85 
core with Helium running up to 480 MHz and feature up to 2 MB
code flash memory, 1 MB SRAM (128 KB of TCM RAM, 896 KB of 
user SRAM), Octal Serial Peripheral Interface (OSPI), Ethernet
MAC Controller (ETHERC), USBFS, USBHS, SD/MMC Host Interface,
Graphics LCD Controller (GLCDC), 2D Drawing Engine (DRW), 
MIPI DSI interface, Analog peripherals, plus Security and 
safety features.
			</description>			
			<debug	svd="SVD/R7FA8D1BH.svd"/>

			<subFamily DsubFamily="RA8D1_1M">
				<memory name="Flash"     access="rx" start="0x02000000" size="0x00100000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x27000000" size="0x3000"/>
				<memory name="ConfigROM" access="r"  start="0x0300A100" size="0x100"/>
				<memory name="ConfigROM_S" access="r"  start="0x0300A200" size="0x100"/>
				<memory name="SRAM"    access="rwx" start="0x22000000" size="0xE0000" init   ="0" default="1"/>
				<memory name="ITCM"    access="rwx" start="0x0" size="0x10000"/>
				<memory name="DTCM"    access="rw" start="0x20000000" size="0x10000"/>

				<algorithm name="Flash/RA8D1_1M.FLM"        start="0x02000000" size="0x00100000" RAMstart="0x22000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA8D1_DATA_C1M.FLM"  start="0x27000000" size="0x3000" RAMstart="0x22000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA8D1_CCONF.FLM"     start="0x0300A100" size="0x000200" RAMstart="0x22000000" RAMsize="0x2000" default="1"/>

				<device Dname="R7FA8D1AF"/>
				<device Dname="R7FA8D1BF"/>
			</subFamily>			

			<subFamily DsubFamily="RA8D1_2M">
				<memory name="Flash"     access="rx" start="0x02000000" size="0x001F8000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x27000000" size="0x3000"/>
				<memory name="ConfigROM" access="r"  start="0x0300A100" size="0x100"/>
				<memory name="ConfigROM_S" access="r"  start="0x0300A200" size="0x100"/>
				<memory name="SRAM"    access="rwx" start="0x22000000" size="0xE0000" init   ="0" default="1"/>
				<memory name="ITCM"    access="rwx" start="0x0" size="0x10000"/>
				<memory name="DTCM"    access="rw" start="0x20000000" size="0x10000"/>

				<algorithm name="Flash/RA8D1_2M.FLM"        start="0x02000000" size="0x001F8000" RAMstart="0x22000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA8D1_DATA_C2M.FLM"  start="0x27000000" size="0x3000" RAMstart="0x22000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA8D1_CCONF.FLM"     start="0x0300A100" size="0x000200" RAMstart="0x22000000" RAMsize="0x2000" default="1"/>

				<device Dname="R7FA8D1AH"/>
				<device Dname="R7FA8D1BH"/>						
			</subFamily>	

		</family>

	    <!-- RA8T1 Part number definitions -->

		<family Dfamily="RA8T1 Series" Dvendor="Renesas:117">
			<processor Dcore="Cortex-M85" DcoreVersion="r0p0" Dtz="TZ" Dfpu="DP_FPU" Dmpu="MPU" Ddsp="DSP" Dmve="FP_MVE" Dpacbti="PACBTI" Dendian="Little-endian" Dclock="480000000" />
			<description>
The RA8T1 Group incorporates a high-performance Arm Cortex-M85 
core with Helium running up to 480 MHz and feature up to 2 MB
code flash memory, 1 MB SRAM (128 KB of TCM RAM, 896 KB of 
user SRAM), Ethernet MAC Controller (ETHERC), USBFS, SD/MMC Host Interface,
Analog peripherals, plus Security and safety features.
			</description>			
			<debug	svd="SVD/R7FA8T1AH.svd"/>

			<subFamily DsubFamily="RA8T1_1M">
				<memory name="Flash"     access="rx" start="0x02000000" size="0x00100000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x27000000" size="0x3000"/>
				<memory name="ConfigROM" access="r"  start="0x0300A100" size="0x100"/>
				<memory name="ConfigROM_S" access="r"  start="0x0300A200" size="0x100"/>
				<memory name="SRAM"    access="rwx" start="0x22000000" size="0xE0000" init   ="0" default="1"/>
				<memory name="ITCM"    access="rwx" start="0x0" size="0x10000"/>
				<memory name="DTCM"    access="rw" start="0x20000000" size="0x10000"/>

				<algorithm name="Flash/RA8T1_1M.FLM"        start="0x02000000" size="0x00100000" RAMstart="0x22000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA8T1_DATA_C1M.FLM"  start="0x27000000" size="0x3000" RAMstart="0x22000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA8T1_CCONF.FLM"     start="0x0300A100" size="0x000200" RAMstart="0x22000000" RAMsize="0x2000" default="1"/>

				<device Dname="R7FA8T1AF"/>
			</subFamily>			

			<subFamily DsubFamily="RA8T1_2M">
				<memory name="Flash"     access="rx" start="0x02000000" size="0x001F8000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x27000000" size="0x3000"/>
				<memory name="ConfigROM" access="r"  start="0x0300A100" size="0x100"/>
				<memory name="ConfigROM_S" access="r"  start="0x0300A200" size="0x100"/>
				<memory name="SRAM"    access="rwx" start="0x22000000" size="0xE0000" init   ="0" default="1"/>
				<memory name="ITCM"    access="rwx" start="0x0" size="0x10000"/>
				<memory name="DTCM"    access="rw" start="0x20000000" size="0x10000"/>

				<algorithm name="Flash/RA8T1_2M.FLM"        start="0x02000000" size="0x001F8000" RAMstart="0x22000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA8T1_DATA_C2M.FLM"  start="0x27000000" size="0x3000" RAMstart="0x22000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA8T1_CCONF.FLM"     start="0x0300A100" size="0x000200" RAMstart="0x22000000" RAMsize="0x2000" default="1"/>

				<device Dname="R7FA8T1AH"/>					
			</subFamily>	
		</family>

	    <!-- RA2E3 Part number definitions -->

