XingGuang111/CSgo--stm32--/枪体代码；红外nec通信（stm32） - 受遥控调控/USER/AppData/Local/Arm/Packs/.Web/Renesas.RA_DFP.pdsc
		<family Dfamily="RA2E3 Series" Dvendor="Renesas:117">
			<processor Dcore="Cortex-M23" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="MPU" Ddsp="NO_DSP" Dendian="Little-endian" Dclock="48000000" />
			<description>
The RA2E3 series incorporates an energy-efficient Arm Cortex-M23
32-bit core, that is particularly well suited for cost-sensitive
and low-power applications and features up to 64-KB code flash 
memory, 16 KB SRAM, 12-bit A/D Converter (ADC12) and safety 
features.
			</description>			
			<debug	svd="SVD/R7FA2E307.svd"/>

			<subFamily DsubFamily="RA2E3_64K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x020000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x40100000" size="0x000800"/>
				<memory name="ConfigROM" access="r"  start="0x01010000" size="0x34"/>
				<memory name="SRAM1"    access="rwx" start="0x20004000" size="0x004000" init   ="0" default="1"/>
				<algorithm name="Flash/RA2E3_64K.FLM"           start="0x00000000" size="0x010000" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA2E3_DATA.FLM"          start="0x40100000" size="0x000800" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA2E3_CONF.FLM"          start="0x01010000" size="0x000034" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA2E307"/>	
			</subFamily>

			<subFamily DsubFamily="RA2E3_32K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x020000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x40100000" size="0x000800"/>
				<memory name="ConfigROM" access="r"  start="0x01010000" size="0x34"/>
				<memory name="SRAM1"    access="rwx" start="0x20004000" size="0x004000" init   ="0" default="1"/>
				<algorithm name="Flash/RA2E3_32K.FLM"           start="0x00000000" size="0x008000" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA2E3_DATA.FLM"          start="0x40100000" size="0x000800" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA2E3_CONF.FLM"          start="0x01010000" size="0x000034" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>
				<device Dname="R7FA2E305"/>	
			</subFamily>
		</family>

	    <!-- RA2A2 Part number definitions -->

		<family Dfamily="RA2A2 Series" Dvendor="Renesas:117">
			<processor Dcore="Cortex-M23" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="MPU" Ddsp="NO_DSP" Dendian="Little-endian" Dclock="48000000" />
			<description>
The RA2A2 Group delivers an ultra low power 48 MHz Arm Cortex-M23 core, up to 512-KB code flash memory, 48-KB SRAM, 12-bit A/D Converter,
24- bit Sigma-Delta A/D Converter, LCD Controller/driver, Independent power supply RTC, On-chip 32-bit multiplier and 
multiply-accumulator, and Security and Safety features.
			</description>			
			<debug	svd="SVD/R7FA2A2AD.svd"/>

			<subFamily DsubFamily="RA2A2_512K">

				<memory name="Flash"     access="rx" start="0x00000000" size="0x80000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x40100000" size="0x2000"/>
				<memory name="ConfigROM" access="r"  start="0x01010000" size="0x34"/>
				<memory name="SRAM1"    access="rwx" start="0x20000000" size="0xC000" init   ="0" default="1"/>

				<algorithm name="Flash/RA2A2_512K.FLM"          start="0x00000000" size="0x080000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA2A2_DATA.FLM"          start="0x40100000" size="0x002000" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA2A2_CONF.FLM"          start="0x01010000" size="0x000034" RAMstart="0x20000000" RAMsize="0x2000" default="1"/>

				<device Dname="R7FA2A2AD"/>
				<device Dname="R7FA2A2BD"/>
			</subFamily>			

		</family>

	    <!-- RA0E1 Part number definitions -->

		<family Dfamily="RA0E1 Series" Dvendor="Renesas:117">
			<processor Dcore="Cortex-M23" DcoreVersion="r0p1" Dfpu="NO_FPU" Dmpu="NO_MPU" Ddsp="NO_DSP" Dendian="Little-endian" Dclock="32000000" />
			<description>
Ultra low power 32 MHz Arm Cortex-M23 core, up to 64-KB code flash memory, 12-KB SRAM, 12-bit A/D Converter, Serial interfaces and Safety features.
			</description>			
			<debug	svd="SVD/R7FA0E107.svd"/>

			<subFamily DsubFamily="RA0E1_64K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x010000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x40100000" size="0x000400"/>
				<memory name="ConfigROM" access="r"  start="0x01010000" size="0x34"/>
				<memory name="SRAM1"    access="rwx" start="0x20004000" size="0x003000" init   ="0" default="1"/>

				<algorithm name="Flash/RA0E1_64K.FLM"           start="0x00000000" size="0x010000" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA0E1_DATA.FLM"          start="0x40100000" size="0x000400" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA0E1_CONF.FLM"          start="0x01010000" size="0x000034" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>

				<device Dname="R7FA0E107"/>	
			</subFamily>

			<subFamily DsubFamily="RA0E1_32K">
				<memory name="Flash"     access="rx" start="0x00000000" size="0x008000" startup="1" default="1"/>
				<memory name="DataFlash" access="r"  start="0x40100000" size="0x000400"/>
				<memory name="ConfigROM" access="r"  start="0x01010000" size="0x34"/>
				<memory name="SRAM1"    access="rwx" start="0x20004000" size="0x003000" init   ="0" default="1"/>

				<algorithm name="Flash/RA0E1_32K.FLM"           start="0x00000000" size="0x008000" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA0E1_DATA.FLM"          start="0x40100000" size="0x000400" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>
				<algorithm name="Flash/RA0E1_CONF.FLM"          start="0x01010000" size="0x000034" RAMstart="0x20004000" RAMsize="0x2000" default="1"/>

				<device Dname="R7FA0E105"/>	
			</subFamily>
		</family>

    </devices>

	<!--
  <boards>	
  </boards>
  -->
  
  <taxonomy>
    <description Cclass="Flex Software" generator="Renesas RA Smart Configurator">Renesas Flex Software</description>
  </taxonomy>
  
  <conditions>
    <condition id="RA Device">
      <require Dvendor="Renesas:117" Dname="R7FA*" />
      <require Tcompiler="ARMCC"/>
    </condition>
  </conditions>
  
  <!-- NOTE: Each RA device family pack needs this -->
  <components>
    <component generator="Renesas RA Smart Configurator" Cgroup="RA Configuration" Cclass="Flex Software" Cversion="1.0.0" condition="RA Device">
      <description>Renesas RA Configuration</description>
      <files>
        <!-- Dummy file to placate schema validator -->
        <file category="other" name="dummy.txt" />
      </files>
    </component>
	<component Cclass="Device" Cgroup="Startup" condition="RA Device" Cversion="1.0.0">
		<description>System Startup for RA devices</description>
		<files>
			<!--  include folder -->
			<file category="include" 	name="Files/include/"/>
			<file category="sourceC"  	attr="config"	name="Files/startup_RA.c"  version="1.0.0"/>
			<file category="sourceC"  	attr="config"	name="Files/system_RA.c"  version="1.0.0"/>
		</files>
	</component>
  </components>

 <!--
 <examples>
</examples>  
  -->
  
</package>
